
#Область ПрограммныйИнтерфейс

Функция ПолучитьВсеКатегории(Токен, Язык = "ru") Экспорт

	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));

	СписокКатегорий = Новый Массив;

	Смещение = 0;
	Лимит = 1000;

	Пока Истина Цикл

		ДанныеAPI = ПолучитьКатегории(Токен, , , Смещение, Лимит, Язык);
		Категории = Неопределено;

		Если ДанныеAPI = Неопределено Тогда
			Прервать;
		КонецЕсли;

		Если Не ДанныеAPI.Свойство("data", Категории) Тогда
			Прервать;
		КонецЕсли;

		Для Каждого Элемент Из Категории Цикл
			СписокКатегорий.Добавить(Элемент);
		КонецЦикла;

		Если Категории.Количество() < Лимит Тогда
			Прервать;
		КонецЕсли;

		Смещение = Смещение + Лимит;

	КонецЦикла;

	Возврат МаппингЗначений.ПрименитьМаппинг(СписокКатегорий, ПолучитьПараметрыМаппинга());

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьКатегории(Токен, ИДРодительскойКатегории = 0, Наименование = "", Смещение = 0, Лимит = 1000, Язык = "ru")
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Язык, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(Лимит, 1, 1000);
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(Смещение, 0);
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(ИДРодительскойКатегории, 0);
	
	АдресСервера = КлиентAPI.СерверКонтента();
	Путь = "/content/v2/object/all";
	
	ПараметрыЗапросаURL = Новый Структура;
	ПараметрыЗапросаURL.Вставить("locale", Язык);
	
	Если НЕ ПустаяСтрока(Наименование) Тогда
		ПараметрыЗапросаURL.Вставить("name", Наименование);
	КонецЕсли;
	
	ПараметрыЗапросаURL.Вставить("limit", Лимит);
	ПараметрыЗапросаURL.Вставить("offset", Смещение);
	
	Если ИДРодительскойКатегории > 0 Тогда
		ПараметрыЗапросаURL.Вставить("parentID", ИДРодительскойКатегории);
	КонецЕсли;
	
	Возврат КлиентAPI.ВыполнитьЗапрос(Токен, АдресСервера, Перечисления.ТипыHTTPЗапроса.GET, Путь, ПараметрыЗапросаURL);
	
КонецФункции

Функция ПолучитьПараметрыМаппинга() Экспорт
	
	ПараметрыМаппинга = Новый Структура;
	// ID предмета
	ПараметрыМаппинга.Вставить("subjectID", Новый Структура("ИмяКлюча, ТипЗначения", "ИдЭлемента", Тип("Число")));
	// ID родительской категории
	ПараметрыМаппинга.Вставить("parentID", Новый Структура("ИмяКлюча, ТипЗначения", "ИдГруппы", Тип("Число")));
	// Название предмета
	ПараметрыМаппинга.Вставить("subjectName", Новый Структура("ИмяКлюча, ТипЗначения", "НаименованиеЭлемента", Тип("Строка")));
	// Название родительской категории
	ПараметрыМаппинга.Вставить("parentName", Новый Структура("ИмяКлюча, ТипЗначения", "НаименованиеГруппы", Тип("Строка")));
	
	Возврат ПараметрыМаппинга;
	
КонецФункции

#КонецОбласти
