
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьТокен(Ссылка) Экспорт
	
	Токен = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Продавцы.ТокенAPI КАК ТокенAPI
		|ИЗ
		|	Справочник.Продавцы КАК Продавцы
		|ГДЕ
		|	Продавцы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Токен = ВыборкаДетальныеЗаписи.ТокенAPI;
	КонецЦикла;
	
	Возврат Токен;
	
КонецФункции

Функция Загрузить(Токен) Экспорт
	
	ДанныеAPI = ИнформацияОПродавцеAPI.ПолучитьИнформациюОПродавце(Токен);

	Если ДанныеAPI = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОбновитьИлиСоздать(ДанныеAPI);
	
КонецФункции

Процедура ЗагрузитьВОбъект(Токен, Объект) Экспорт
	
	Если  Объект = Неопределено Тогда
		ВызватьИсключение("Не заполнен обязательный параметр объект", КатегорияОшибки.ОшибкаКонфигурации);
	КонецЕсли;
	
	ДанныеAPI = ИнформацияОПродавцеAPI.ПолучитьИнформациюОПродавце(Токен);
	
	Если ДанныеAPI = Неопределено Тогда
		ВызватьИсключение "Не удалось загрузить данные";
	КонецЕсли;
	
	ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбновитьИлиСоздать(ДанныеAPI)
	
	Объект = Неопределено;
	Ссылка = НайтиПоРеквизиту("Ууид", ДанныеAPI.Ууид);
	
	Если Ссылка = Неопределено Тогда
		Объект = СоздатьЭлемент();
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI);
	
	Объект.Записать();
КонецФункции

Процедура ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI)
	
	Объект.Наименование = ДанныеAPI.Наименование;
	Объект.НазваниеМагазина = ДанныеAPI.НазваниеМагазина;
	Объект.ИНН = ДанныеAPI.ИНН;
	Объект.Сид = ДанныеAPI.Ууид;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
