
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВыбратьВсехПродавцов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Продавцы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Продавцы КАК Продавцы
		|ГДЕ
		|	НЕ Продавцы.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаЗначений = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаЗначений.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПолучитьДатуРегистрации(Ссылка) Экспорт
	
	ДатаРегистрации = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Продавцы.ДатаРегистрации КАК ДатаРегистрации
		|ИЗ
		|	Справочник.Продавцы КАК Продавцы
		|ГДЕ
		|	Продавцы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДатаРегистрации = ВыборкаДетальныеЗаписи.ДатаРегистрации;
	КонецЦикла;
	
	Если ДатаРегистрации = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ДатаРегистрации) Тогда
		ВызватьИсключение("Заполните дату регистрации продавца на маркетплейсе");
	КонецЕсли;
	
	Возврат ДатаРегистрации;
	
КонецФункции


Функция ПолучитьТокен(Ссылка) Экспорт
	
	Токен = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Продавцы.ТокенAPI КАК ТокенAPI
		|ИЗ
		|	Справочник.Продавцы КАК Продавцы
		|ГДЕ
		|	Продавцы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Токен = ВыборкаДетальныеЗаписи.ТокенAPI;
	КонецЦикла;
	
	Если Токен = Неопределено Тогда
		ВызватьИсключение("Заполните токен продавца");
	КонецЕсли;
	
	Возврат Токен;
	
КонецФункции

Функция Загрузить(Токен) Экспорт
	
	ДанныеAPI = ИнформацияОПродавцеAPI.ПолучитьИнформациюОПродавце(Токен);

	Если ДанныеAPI = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОбновитьИлиСоздать(ДанныеAPI);
	
КонецФункции

Процедура ЗагрузитьВОбъект(Токен, Объект) Экспорт
	
	Если  Объект = Неопределено Тогда
		ВызватьИсключение("Не заполнен обязательный параметр объект", КатегорияОшибки.ОшибкаКонфигурации);
	КонецЕсли;
	
	ДанныеAPI = ИнформацияОПродавцеAPI.ПолучитьИнформациюОПродавце(Токен);
	
	Если ДанныеAPI = Неопределено Тогда
		ВызватьИсключение "Не удалось загрузить данные";
	КонецЕсли;
	
	ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбновитьИлиСоздать(ДанныеAPI)
	
	Объект = Неопределено;
	Ссылка = НайтиПоРеквизиту("Ууид", ДанныеAPI.Ууид);
	
	Если Ссылка = Неопределено Тогда
		Объект = СоздатьЭлемент();
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI);
	Объект.Записать();
	
КонецФункции

Процедура ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI)
	
	МаппингЗначений.ЗаполнитьОбъектИзДанных(Объект, ДанныеAPI);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
