
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		Ссылка = Параметры.Свойство("Ключ");
		
		Если Ссылка = Неопределено Или Ссылка.Пустая() Тогда
			ВыбраннаяФорма = "Справочник.Продавцы.Форма.ФормаСоздания";
		Иначе
			ВыбраннаяФорма = "Справочник.Продавцы.Форма.ФормаЭлемента";
		КонецЕсли;

		СтандартнаяОбработка = Ложь;

	КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
