
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция Загрузить(Токен) Экспорт
	
	ДанныеAPI = ИнформацияОПродавцеAPI.ПолучитьИнформациюОПродавце(Токен);
	
	Если ДанныеAPI = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Ссылка = НайтиПоУуид(ДанныеAPI.Ууид);
	Объект = Неопределено;
	
	Если Ссылка = Неопределено Тогда
		Объект = СоздатьЭлемент();
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI);
	
	Объект.Записать();
	
КонецФункции

Функция НайтиПоУуид(Ууид)
	
	
	
КонецФункции

Процедура ЗагрузитьВОбъект(Токен, Объект) Экспорт
	
	Если  Объект = Неопределено Тогда
		ВызватьИсключение("Не заполнен обязательный параметр объект", КатегорияОшибки.ОшибкаКонфигурации);
	КонецЕсли;
	
	ДанныеAPI = ИнформацияОПродавцеAPI.ПолучитьИнформациюОПродавце(Токен);
	
	Если ДанныеAPI = Неопределено Тогда
		ВызватьИсключение "Не удалось загрузить данные";
	КонецЕсли;
	
	ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI)
	
	Объект.Наименование = ДанныеAPI.Наименование;
	Объект.НазваниеМагазина = ДанныеAPI.НазваниеМагазина;
	Объект.ИНН = ДанныеAPI.ИНН;
	Объект.Сид = ДанныеAPI.Ууид;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
