// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	
	// Формируем JSON тело запроса
	ТелоJSON = Новый Структура;
	ТелоJSON.Вставить("model", "gpt://" + Объект.ИдКаталога + "/" + Объект.Модель);
	ТелоJSON.Вставить("instructions", Объект.Инструкция);
	ТелоJSON.Вставить("temperature", 0.8);
	ТелоJSON.Вставить("max_output_tokens", 1500);
	ТелоJSON.Вставить("input", Объект.Сообщение);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ТелоJSON);
	СтрокаJSON = ЗаписьJSON.Закрыть();

	// Создаем HTTP запрос
	HTTPЗапрос = Новый HTTPЗапрос("/v1/responses");
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Api-Key " + Объект.КлючAPI);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON, "utf-8");

	// Создаем HTTP соединение
	HTTPСоединение = Новый HTTPСоединение("ai.api.cloud.yandex.net", , , , , , Новый ЗащищенноеСоединениеOpenSSL);
	Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);

	Если Ответ.КодСостояния = 200 Тогда
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		Сообщить(ТелоОтвета);
	Иначе
		Сообщить("Ошибка: " + Ответ.КодСостояния + "/n" + Ответ.ПолучитьТелоКакСтроку());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
