#Область ПрограммныйИнтерфейс

Функция ПолучитьJSON(Значение) Экспорт
	
	Если Значение = Неопределено Тогда
		Возврат Неопределено
	КонецЕсли;

	Настройки = Новый НастройкиСериализацииJSON;
	Настройки.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	Настройки.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();

	ЗаписатьJSON(ЗаписьJSON, Значение, Настройки);
	РезультатJSON = ЗаписьJSON.Закрыть();

	Возврат РезультатJSON;

КонецФункции

Функция ПолучитьЗначение(СтрокаJSON, ПараметрыМаппинга = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтрокаJSON) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);

	Попытка
		Данные = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		ЧтениеJSON.Закрыть();
		ВызватьИсключение("Ошибка чтения JSON", КатегорияОшибки.ОшибкаВнешнегоИсточникаДанных);
	КонецПопытки;

	ЧтениеJSON.Закрыть();

	Если ПараметрыМаппинга <> Неопределено Тогда
		Данные = ПреобразованиеЗначений.ПрименитьМаппинг(Данные, ПараметрыМаппинга);
	КонецЕсли;

	Возврат Данные;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти