
#Область ПрограммныйИнтерфейс

Функция ПолучитьСписокЕжедневныхОтчетовРеализации(Токен, НачалоПериода, КонецПериода, Лимит = 1000, Смещение = 0) Экспорт
	
	// Проверка входных параметров
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьПериод(НачалоПериода, КонецПериода);
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(Лимит, 1, 1000);
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(Смещение, 0);
	
	АдресСервера = КлиентAPI.СерверФинансов();
	Путь = "/api/finance/v1/sales-reports/list";
	ПериодичностьОтчета = "daily";
	
	ПараметрыJSON = Новый Структура;
	ПараметрыJSON.Вставить("dateFrom", НачалоПериода);
	ПараметрыJSON.Вставить("dateTo", КонецПериода);
	ПараметрыJSON.Вставить("limit", Лимит);
	ПараметрыJSON.Вставить("offset", Смещение);
	ПараметрыJSON.Вставить("period", ПериодичностьОтчета);

	Возврат КлиентAPI.ВыполнитьЗапрос(Токен, АдресСервера, Перечисления.ТипыHTTPЗапроса.POST, Путь, , ПараметрыJSON);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
