
#Область ПрограммныйИнтерфейс

Функция ПолучитьСписокЕжедневныхОтчетовРеализации(Токен, НачалоПериода, КонецПериода, Лимит = 1000, Смещение = 0) Экспорт
	
	// Проверка входных параметров
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьПериод(НачалоПериода, КонецПериода);
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(Лимит, 1, 1000);
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(Смещение, 0);
	
	АдресСервера = КлиентAPI.СерверФинансов();
	Путь = "/api/finance/v1/sales-reports/list";
	ПериодичностьОтчета = "daily";
	
	ПараметрыJSON = Новый Структура;
	ПараметрыJSON.Вставить("dateFrom", НачалоПериода);
	ПараметрыJSON.Вставить("dateTo", КонецПериода);
	ПараметрыJSON.Вставить("limit", Лимит);
	ПараметрыJSON.Вставить("offset", Смещение);
	ПараметрыJSON.Вставить("period", ПериодичностьОтчета);
	
	ПараметрыМаппинга = Новый Структура;
	// ID отчёта
	ПараметрыМаппинга.Вставить("reportId", Новый Структура("ИмяКлюча, ТипЗначения", "Номер", Тип("Число")));
	// Наименование продавца
	ПараметрыМаппинга.Вставить("sellerFinanceName", Новый Структура("ИмяКлюча, ТипЗначения", "НаименованиеПродавца", Тип("Строка")));
	// Дата начала отчётного периода
	ПараметрыМаппинга.Вставить("dateFrom", Новый Структура("ИмяКлюча, ТипЗначения", "НачалоПериода", Тип("Дата")));
	// Дата конца отчётного периода
	ПараметрыМаппинга.Вставить("dateTo", Новый Структура("ИмяКлюча, ТипЗначения", "КонецПериода", Тип("Дата")));
	// Дата формирования отчёта
	ПараметрыМаппинга.Вставить("createDate", Новый Структура("ИмяКлюча, ТипЗначения", "Дата", Тип("Дата")));
	// Валюта отчёта
//	ПараметрыМаппинга.Вставить("currency", "Валюта");
//	// Тип отчёта: 1 - основной, 2 - по выкупам, 3 - по выкупам для Грузии
//	ПараметрыМаппинга.Вставить("reportType", "ТипОтчета");
//	// Продажа
//	ПараметрыМаппинга.Вставить("retailAmountSum", "СуммаПродаж");
//	// К перечислению за товар
//	ПараметрыМаппинга.Вставить("forPaySum", "СуммаКПеречислению");
//	// Согласованная скидка, %
//	ПараметрыМаппинга.Вставить("avgSalePercent", "ПроцентСогласованнойСкидки");
//	// Стоимость логистики
//	ПараметрыМаппинга.Вставить("deliveryServiceSum", "СтоимостьЛогистики");
//	// Стоимость хранения
//	ПараметрыМаппинга.Вставить("paidStorageSum", "СтоимостьХранения");
//	// Стоимость операций при приёмке
//	ПараметрыМаппинга.Вставить("paidAcceptanceSum", "СтоимостьПриемки");
//	// Прочие удержания и выплаты
//	ПараметрыМаппинга.Вставить("deductionSum", "СуммаПрочихУдержаний");
//	// Общая сумма штрафов
//	ПараметрыМаппинга.Вставить("penaltySum", "СуммаШтрафов");
//	// Корректировка Вознаграждения Вайлдберриз (ВВ)
//	ПараметрыМаппинга.Вставить("additionalPaymentSum", "СуммаКорректировкиВознаграждения");
//	// Сумма, удержанная за начисленные баллы программы лояльности
//	ПараметрыМаппинга.Вставить("cashbackAmountSum", "СуммаУдержанияЗаБаллы");
//	// Компенсация скидки по программе лояльности
//	ПараметрыМаппинга.Вставить("cashbackDiscountSum", "СуммаКомпенсацииСкидкиЛояльности");
//	// Стоимость участия в программе лояльности
//	ПараметрыМаппинга.Вставить("cashbackCommissionChangeSum", "СтоимостьУчастияВЛояльности");
//	// Разовое изменение срока перечисления денежных средств
//	ПараметрыМаппинга.Вставить("paymentSchedule", "СтоимостьИзмененияСрокаПеречисления");
//	// Итого к оплате
//	ПараметрыМаппинга.Вставить("bankPaymentSum", "СуммаКОплате");

	Возврат КлиентAPI.ВыполнитьЗапрос(Токен, АдресСервера, Перечисления.ВидHTTPЗапроса.POST, Путь, , ПараметрыJSON, ПараметрыМаппинга);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
