
#Область ПрограммныйИнтерфейс

Функция ПолучитьВсеЕжедневныеОтчетыРеализации(Токен, НачалоПериода, КонецПериода = Неопределено) Экспорт

	Если КонецПериода = Неопределено Тогда
		КонецПериода = ТекущаяДатаСеанса();
	КонецЕсли;

	Результат = Новый Массив;

	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(НачалоПериода, Тип("Дата"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(КонецПериода, Тип("Дата"));

	Лимит = 1000;
	Смещение = 0;

	Пока Истина Цикл

		ДанныеAPI = ПолучитьЕжедневныеОтчетыРеализации(Токен, НачалоПериода, КонецПериода, Лимит, Смещение);
		
		Если ДанныеAPI = Неопределено Тогда
			Возврат Результат;
		КонецЕсли;

		Для Каждого ЭлементAPI Из ДанныеAPI Цикл
			Результат.Добавить(ЭлементAPI);
		КонецЦикла;

		Если ДанныеAPI.Количество() < Лимит Тогда
			Прервать;
		КонецЕсли;

		Смещение = Смещение + Лимит;

	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ПолучитьЕжедневныеОтчетыРеализации(Токен, НачалоПериода, КонецПериода, Лимит = 1000, Смещение = 0) Экспорт
	
	// Проверка входных параметров
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьПериод(НачалоПериода, КонецПериода);
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(Лимит, 1, 1000);
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(Смещение, 0);
	
	АдресСервера = КлиентAPI.СерверФинансов();
	Путь = "/api/finance/v1/sales-reports/list";
	ПериодичностьОтчета = "daily";
	
	ПараметрыJSON = Новый Структура;
	ПараметрыJSON.Вставить("dateFrom", НачалоПериода);
	ПараметрыJSON.Вставить("dateTo", КонецПериода);
	ПараметрыJSON.Вставить("limit", Лимит);
	ПараметрыJSON.Вставить("offset", Смещение);
	ПараметрыJSON.Вставить("period", ПериодичностьОтчета);

	ДанныеAPI = КлиентAPI.ВыполнитьЗапрос(Токен, АдресСервера, Перечисления.ТипыHTTPЗапроса.POST, Путь, , ПараметрыJSON);
	Возврат МаппингЗначений.ПрименитьМаппинг(ДанныеAPI, ПолучитьПараметрыМаппинга());
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПараметрыМаппинга()
	
	ПараметрыМаппинга = Новый Структура;
	// ID отчёта
	ПараметрыМаппинга.Вставить("reportId", Новый Структура("ИмяКлюча, ТипЗначения", "ИдОтчета", Тип("Число")));
	// Дата начала отчётного периода
	ПараметрыМаппинга.Вставить("dateFrom", Новый Структура("ИмяКлюча, ТипЗначения", "НачалоПериода", Тип("Дата")));
	// Дата конца отчётного периода
	ПараметрыМаппинга.Вставить("dateTo", Новый Структура("ИмяКлюча, ТипЗначения", "КонецПериода", Тип("Дата")));
	// Дата формирования отчёта
	ПараметрыМаппинга.Вставить("createDate", Новый Структура("ИмяКлюча, ТипЗначения", "Дата", Тип("Дата")));
	// Валюта отчёта
	ПараметрыМаппинга.Вставить("currency", Новый Структура("ИмяКлюча, ТипЗначения", "Валюта", Тип("Строка")));
	// Тип отчёта: 1 - основной, 2 - по выкупам, 3 - по выкупам для Грузии
	ПараметрыМаппинга.Вставить("reportType", Новый Структура("ИмяКлюча, ТипЗначения", "ВидОтчета", Тип("Число")));
	// Продажа
	ПараметрыМаппинга.Вставить("retailAmountSum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаПродаж", Тип("Число")));
	// К перечислению за товар
	ПараметрыМаппинга.Вставить("forPaySum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаКПеречислению", Тип("Число")));
	// Согласованная скидка, %
	ПараметрыМаппинга.Вставить("avgSalePercent", Новый Структура("ИмяКлюча, ТипЗначения", "ПроцентСогласованнойСкидки", Тип("Число")));
	// Стоимость логистики
	ПараметрыМаппинга.Вставить("deliveryServiceSum", Новый Структура("ИмяКлюча, ТипЗначения", "СтоимостьЛогистики", Тип("Число")));
	// Стоимость хранения
	ПараметрыМаппинга.Вставить("paidStorageSum", Новый Структура("ИмяКлюча, ТипЗначения", "СтоимостьХранения", Тип("Число")));
	// Стоимость операций при приёмке
	ПараметрыМаппинга.Вставить("paidAcceptanceSum", Новый Структура("ИмяКлюча, ТипЗначения", "СтоимостьПриемки", Тип("Число")));
	// Прочие удержания и выплаты
	ПараметрыМаппинга.Вставить("deductionSum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаПрочихУдержаний", Тип("Число")));
	// Общая сумма штрафов
	ПараметрыМаппинга.Вставить("penaltySum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаШтрафов", Тип("Число")));
	// Корректировка Вознаграждения Вайлдберриз (ВВ)
	ПараметрыМаппинга.Вставить("additionalPaymentSum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаКорректировкиВознаграждения", Тип("Число")));
	// Сумма, удержанная за начисленные баллы программы лояльности
	ПараметрыМаппинга.Вставить("cashbackAmountSum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаУдержанияЗаБаллы", Тип("Число")));
	// Компенсация скидки по программе лояльности
	ПараметрыМаппинга.Вставить("cashbackDiscountSum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаКомпенсацииСкидкиЛояльности", Тип("Число")));
	// Стоимость участия в программе лояльности
	ПараметрыМаппинга.Вставить("cashbackCommissionChangeSum", Новый Структура("ИмяКлюча, ТипЗначения", "СтоимостьУчастияВЛояльности", Тип("Число")));
	// Разовое изменение срока перечисления денежных средств
	ПараметрыМаппинга.Вставить("paymentSchedule", Новый Структура("ИмяКлюча, ТипЗначения", "СтоимостьИзмененияСрокаПеречисления", Тип("Число")));
	// Итого к оплате
	ПараметрыМаппинга.Вставить("bankPaymentSum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаКОплате", Тип("Число")));
	
	Возврат ПараметрыМаппинга;
	
КонецФункции

#КонецОбласти
