
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьВсе() Экспорт
	
	Продавцы = Справочники.Продавцы.ВыбратьВсехПродавцов();
	
	Для Каждого Продавец Из Продавцы Цикл
		ЗагрузитьПоПродавцу(Продавец);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьПоПродавцу(Продавец) Экспорт
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Продавец, Тип("СправочникСсылка.Продавцы"));
	
	Токен = Справочники.Продавцы.ПолучитьТокен(Продавец);
	ДанныеAPI = КарточкиТоваровAPI.ПолучитьВсеКарточкиТоваров(Токен);
	
	Для Каждого ЭлементAPI Из ДанныеAPI Цикл
		ОбновитьИлиСоздать(ЭлементAPI, Продавец);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбновитьИлиСоздать(ДанныеAPI, Продавец)
	
	Объект = Неопределено;
	Ссылка = НайтиПоРеквизиту("АртикулWB", ДанныеAPI.АртикулWB, , Продавец);
	
	Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
		Объект = СоздатьЭлемент();
		Объект.Владелец = Продавец;
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI);
	
	Объект.Записать();
	
	РазмерыAPI = Неопределено;
	Если ДанныеAPI.Свойство("Размеры", РазмерыAPI) Тогда
		Для Каждого ЭлементAPI Из РазмерыAPI Цикл
			Справочники.РазмерыКарточекТоваров.ОбновитьИлиСоздать(ЭлементAPI, Объект.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Объект.Ссылка;
	
КонецФункции

Процедура ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI);
	
	Объект.Наименование = ДанныеAPI.Наименование;
	Объект.АртикулWB = ДанныеAPI.АртикулWB;
	Объект.АртикулПродавца = ДанныеAPI.АртикулПродавца;
	Объект.Категория = Справочники.КатегорииТоваров.НайтиПоРеквизиту("Ид", ДанныеAPI.ИдКатегории);
	Объект.ДатаСоздания = ДанныеAPI.ДатаСоздания;
	Объект.ДатаИзменения = ДанныеAPI.ДатаИзменения;
	Объект.Бренд = ДанныеAPI.Бренд;
	Объект.Описание = ДанныеAPI.Описание;
	Объект.ИдОбъединеннойКарточки = ДанныеAPI.ИдОбъединеннойКарточки;
	Объект.ИдВнутренний = ДанныеAPI.ИдВнутренний;
	Объект.ТребуетсяКодМаркировки = ДанныеAPI.ТребуетсяКодМаркировки;
	Объект.КодМаркировкиНанесен = ДанныеAPI.КодМаркировкиНанесен;
	Объект.ЕстьПримерка = ДанныеAPI.ЕстьПримерка;

	Габариты = ДанныеAPI.Габариты;
	Объект.Длина = Габариты.Длина;
	Объект.Ширина = Габариты.Ширина;
	Объект.Высота = Габариты.Высота;
	Объект.ВесБрутто = Габариты.ВесБрутто;
	Объект.ГабаритыПроверены = Габариты.ГабаритыПроверены;
	
	ОптовыеПродажи = Неопределено;
	Если ДанныеAPI.Свойство("ОптовыеПродажи", ОптовыеПродажи) Тогда
		Объект.ОптовыеПродажи = ОптовыеПродажи.Используются;
		Объект.КоличествоВУпаковке = ОптовыеПродажи.КоличествоВУпаковке;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
