
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьВсе() Экспорт
	
	Продавцы = Справочники.Продавцы.ВыбратьВсехПродавцов();
	
	Для Каждого Продавец Из Продавцы Цикл
		ЗагрузитьПоПродавцу(Продавец);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьПоПродавцу(Продавец) Экспорт
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Продавец, Тип("СправочникСсылка.Продавцы"));
	
	Токен = Справочники.Продавцы.ПолучитьТокен(Продавец);
	
	ДанныеAPI = КарточкиТоваровAPI.ПолучитьВсеКарточкиТоваров(Токен);
	ДанныеAPI = МаппингЗначений.ПрименитьМаппинг(ДанныеAPI, ПолучитьПараметрыМаппинга());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПараметрыМаппинга()
	
	ПараметрыМаппинга = Новый Структура;
	// Артикул WB
	ПараметрыМаппинга.Вставить("nmID", Новый Структура("ИмяКлюча, ТипЗначения", "АртикулWB", Тип("Число")));
	// ID для объединённых карточек товаров
	ПараметрыМаппинга.Вставить("imtID", Новый Структура("ИмяКлюча, ТипЗначения", "IDОбъединеннойКарточки", Тип("Число")));
	// Внутренний технический ID карточки товара
	ПараметрыМаппинга.Вставить("nmUUID", Новый Структура("ИмяКлюча, ТипЗначения", "ВнутреннийID", Тип("Строка")));
	// ID предмета
	ПараметрыМаппинга.Вставить("subjectID", Новый Структура("ИмяКлюча, ТипЗначения", "ПредметID", Тип("Число")));
	// Название предмета
	ПараметрыМаппинга.Вставить("subjectName", Новый Структура("ИмяКлюча, ТипЗначения", "ПредметНаименование", Тип("Строка")));
	// Артикул продавца
	ПараметрыМаппинга.Вставить("vendorCode", Новый Структура("ИмяКлюча, ТипЗначения", "АртикулПродавца", Тип("Строка")));
	// Бренд
	ПараметрыМаппинга.Вставить("brand", Новый Структура("ИмяКлюча, ТипЗначения", "Бренд", Тип("Строка")));
	// Наименование товара
	ПараметрыМаппинга.Вставить("title", Новый Структура("ИмяКлюча, ТипЗначения", "Наименование", Тип("Строка")));
	// Описание товара
	ПараметрыМаппинга.Вставить("description", Новый Структура("ИмяКлюча, ТипЗначения", "Описание", Тип("Строка")));
	// Требуется ли код маркировки
	ПараметрыМаппинга.Вставить("needKiz", Новый Структура("ИмяКлюча, ТипЗначения", "ТребуетсяКодМаркировки", Тип("Булево")));
	// Есть ли подтверждение о нанесении кода маркировки
	ПараметрыМаппинга.Вставить("kizMarked", Новый Структура("ИмяКлюча, ТипЗначения", "КодМаркировкиНанесен", Тип("Булево")));
	// Массив фото
	ПараметрыМаппинга.Вставить("photos", Новый Структура(
		"ИмяКлюча, ТипЗначения, ПараметрыМаппинга", 
		"Фото", Тип("Структура"), ПолучитьПараметрыМаппингаФото()));
	// Оптовая продажа
	ПараметрыМаппинга.Вставить("wholesale", Новый Структура(
		"ИмяКлюча, ТипЗначения, ПараметрыМаппинга", 
		"ОптоваяПродажа", Тип("Структура"), ПолучитьПараметрыМаппингаОпт()));
	// Габариты и вес товара
	ПараметрыМаппинга.Вставить("dimensions", Новый Структура(
		"ИмяКлюча, ТипЗначения, ПараметрыМаппинга", 
		"Габариты", Тип("Структура"), ПолучитьПараметрыМаппингаГабариты()));
	// Характеристики
	ПараметрыМаппинга.Вставить("characteristics", Новый Структура(
		"ИмяКлюча, ТипЗначения, ПараметрыМаппинга", 
		"Характеристики", Тип("Структура"), ПолучитьПараметрыМаппингаХарактеристики()));
	// Размеры товара
	ПараметрыМаппинга.Вставить("sizes", Новый Структура(
		"ИмяКлюча, ТипЗначения, ПараметрыМаппинга", 
		"Размеры", Тип("Структура"), ПолучитьПараметрыМаппингаРазмеры()));
	// Ярлыки
	ПараметрыМаппинга.Вставить("tags", Новый Структура(
		"ИмяКлюча, ТипЗначения, ПараметрыМаппинга", 
		"Ярлыки", Тип("Структура"), ПолучитьПараметрыМаппингаЯрлыки()));
	// Дата и время создания
	ПараметрыМаппинга.Вставить("createdAt", Новый Структура("ИмяКлюча, ТипЗначения", "ДатаСоздания", Тип("Строка")));
	// Дата и время изменения
	ПараметрыМаппинга.Вставить("updatedAt", Новый Структура("ИмяКлюча, ТипЗначения", "ДатаИзменения", Тип("Строка")));
	
	Возврат ПараметрыМаппинга;
	
КонецФункции

Функция ПолучитьПараметрыМаппингаФото()
	
	Параметры = Новый Структура;
	// URL фото 900x1200
	Параметры.Вставить("big", Новый Структура("ИмяКлюча, ТипЗначения", "Большое", Тип("Строка")));
	// URL фото 248x328
	Параметры.Вставить("c246x328", Новый Структура("ИмяКлюча, ТипЗначения", "Малое246", Тип("Строка")));
	// URL фото 516x688
	Параметры.Вставить("c516x688", Новый Структура("ИмяКлюча, ТипЗначения", "Среднее516", Тип("Строка")));
	// URL фото 600x600
	Параметры.Вставить("square", Новый Структура("ИмяКлюча, ТипЗначения", "Квадрат", Тип("Строка")));
	// URL фото 75x100
	Параметры.Вставить("tm", Новый Структура("ИмяКлюча, ТипЗначения", "Миниатюра", Тип("Строка")));
	// URL видео
	Параметры.Вставить("video", Новый Структура("ИмяКлюча, ТипЗначения", "Видео", Тип("Строка")));
	
	Возврат Параметры;
	
КонецФункции

Функция ПолучитьПараметрыМаппингаОпт()
	
	Параметры = Новый Структура;
	// Предназначена ли карточка для оптовой продажи
	Параметры.Вставить("enabled", Новый Структура("ИмяКлюча, ТипЗначения", "Включен", Тип("Булево")));
	// Количество единиц товара в упаковке
	Параметры.Вставить("quantum", Новый Структура("ИмяКлюча, ТипЗначения", "Количество", Тип("Число")));
	
	Возврат Параметры;
	
КонецФункции

Функция ПолучитьПараметрыМаппингаГабариты()
	
	Параметры = Новый Структура;
	// Длина, см
	Параметры.Вставить("length", Новый Структура("ИмяКлюча, ТипЗначения", "Длина", Тип("Число")));
	// Ширина, см
	Параметры.Вставить("width", Новый Структура("ИмяКлюча, ТипЗначения", "Ширина", Тип("Число")));
	// Высота, см
	Параметры.Вставить("height", Новый Структура("ИмяКлюча, ТипЗначения", "Высота", Тип("Число")));
	// Вес, кг
	Параметры.Вставить("weightBrutto", Новый Структура("ИмяКлюча, ТипЗначения", "ВесБрутто", Тип("Число")));
	
	Возврат Параметры;
	
КонецФункции

Функция ПолучитьПараметрыМаппингаХарактеристики()
	
	Параметры = Новый Структура;
	// ID характеристики
	Параметры.Вставить("id", Новый Структура("ИмяКлюча, ТипЗначения", "ID", Тип("Число")));
	// Название характеристики
	Параметры.Вставить("name", Новый Структура("ИмяКлюча, ТипЗначения", "Наименование", Тип("Строка")));
	// Значение характеристики
	Параметры.Вставить("value", Новый Структура("ИмяКлюча, ТипЗначения", "Значение", Тип("Строка")));
	
	Возврат Параметры;
	
КонецФункции

Функция ПолучитьПараметрыМаппингаРазмеры()
	
	Параметры = Новый Структура;
	// Числовой ID размера
	Параметры.Вставить("chrtID", Новый Структура("ИмяКлюча, ТипЗначения", "ИДРазмера", Тип("Число")));
	// Размер товара
	Параметры.Вставить("techSize", Новый Структура("ИмяКлюча, ТипЗначения", "Размер", Тип("Строка")));
	// Российский размер
	Параметры.Вставить("wbSize", Новый Структура("ИмяКлюча, ТипЗначения", "РазмерРФ", Тип("Строка")));
	// Баркоды
	Параметры.Вставить("skus", Новый Структура("ИмяКлюча, ТипЗначения", "Баркоды", Тип("Строка")));
	
	Возврат Параметры;
	
КонецФункции

Функция ПолучитьПараметрыМаппингаЯрлыки()
	
	Параметры = Новый Структура;
	// ID ярлыка
	Параметры.Вставить("id", Новый Структура("ИмяКлюча, ТипЗначения", "ID", Тип("Число")));
	// Название ярлыка
	Параметры.Вставить("name", Новый Структура("ИмяКлюча, ТипЗначения", "Наименование", Тип("Строка")));
	// Цвет ярлыка
	Параметры.Вставить("color", Новый Структура("ИмяКлюча, ТипЗначения", "Цвет", Тип("Строка")));
	
	Возврат Параметры;
	
КонецФункции


#КонецОбласти

#КонецЕсли
