// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Загрузить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ТокенAPI) Тогда
		ПоказатьПредупреждение(, "Заполните токен API перед загрузкой");
		Возврат
	КонецЕсли;
	
	ЗагрузитьНаСервере();
	
	ПоказатьОповещениеПользователя("Данные успешно загружены");
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗагрузитьНаСервере()
	Справочники.Продавцы.ЗагрузитьВОбъект(Объект.ТокенAPI, Объект);
КонецПроцедуры
#КонецОбласти