#Область ПрограммныйИнтерфейс

Функция ВыполнитьЗапрос(Токен, Сервер, ВидЗапроса, Путь, ПараметрыURL = Неопределено, ПараметрыJSON = Неопределено,
	СоответствиеКлючей = Неопределено) Экспорт

	Таймаут = 30;
	УспешныйКодСостояния = 200;
	
	Если ПараметрыURL <> Неопределено Тогда
		Путь = Путь + "?" + СтруктураВПараметрыURL(ПараметрыURL);
	КонецЕсли;

	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
	Соединение = Новый HTTPСоединение(Сервер, , , , , Таймаут, ЗащищенноеСоединение);
	Запрос = Новый HTTPЗапрос(Путь);
	Запрос.Заголовки.Вставить("Authorization", Токен);
	Запрос.Заголовки.Вставить("Content-Type", "application/json");
	Запрос.Заголовки.Вставить("Accept", "application/json");
	
	Если ПараметрыJSON <> Неопределено Тогда
		СтрокаJSON = СтруктураВJSON(ПараметрыJSON);
		Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
	КонецЕсли;

	Попытка
		Если ВидЗапроса = Перечисления.ВидHTTPЗапроса.GET Тогда
			Ответ = Соединение.Получить(Запрос);
		ИначеЕсли ВидЗапроса = Перечисления.ВидHTTPЗапроса.POST Тогда
			Ответ = Соединение.ОтправитьДляОбработки(Запрос);
		Иначе
			ВызватьИсключение("Не поддерживаемый тип запроса", КатегорияОшибки.ОшибкаСети);
		КонецЕсли;
	Исключение
		ВызватьИсключение("Ошибка соединения с сервером", КатегорияОшибки.ОшибкаСети);
	КонецПопытки;

	Если Ответ.КодСостояния <> УспешныйКодСостояния Тогда
		ВызватьИсключение("Ошибка получения данных. Код: " + Ответ.КодСостояния, КатегорияОшибки.ОшибкаСети);
	КонецЕсли;

	ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстОтвета);

	Попытка
		Данные = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		ЧтениеJSON.Закрыть();
		ВызватьИсключение("Ошибка чтения ответа в формате JSON", КатегорияОшибки.ОшибкаКонфигурации);
	КонецПопытки;

	ЧтениеJSON.Закрыть();

	Если СоответствиеКлючей <> Неопределено Тогда
		Данные = ПарсингJSON.ЗаменитьКлючиВСтруктуре(Данные, СоответствиеКлючей);
	КонецЕсли;

	Возврат Данные;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтруктураВПараметрыURL(Структура)
	
	Результат = "";
	
	Для Каждого КлючЗначение Из Структура Цикл
		
		Если Результат <> "" Тогда
			Результат = Результат + "&";
		КонецЕсли;
		
		Значение = Строка(КлючЗначение.Значение);
		Результат = Результат + КлючЗначение.Ключ + "=" + Значение;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция СтруктураВJSON(Структура)
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто));
    ЗаписатьJSON(ЗаписьJSON, Структура);
    Возврат ЗаписьJSON.Закрыть();
КонецФункции

#КонецОбласти