#Область ПрограммныйИнтерфейс

Функция ВыполнитьЗапрос(Токен, Сервер, ВидЗапроса, Путь, ПараметрыURL = Неопределено, ПараметрыJSON = Неопределено,
	СоответствиеКлючей = Неопределено) Экспорт
	
	// Проверка входных параметров
	Если Не ЗначениеЗаполнено(Токен) Или Не ЗначениеЗаполнено(Сервер) Или Не ЗначениеЗаполнено(ВидЗапроса)
		Или Не ЗначениеЗаполнено(Путь) Тогда
		ВызватьИсключение("Не заполнены обязательные параметры функции", КатегорияОшибки.ОшибкаКонфигурации);
	КонецЕсли;

	Таймаут = 30;

	Если ПараметрыURL <> Неопределено Тогда
		Путь = Путь + "?" + СтруктураВПараметрыURL(ПараметрыURL);
	КонецЕсли;

	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
	Соединение = Новый HTTPСоединение(Сервер, , , , , Таймаут, ЗащищенноеСоединение);
	Запрос = Новый HTTPЗапрос(Путь);
	Запрос.Заголовки.Вставить("Authorization", Токен);
	Запрос.Заголовки.Вставить("Content-Type", "application/json");
	Запрос.Заголовки.Вставить("Accept", "application/json");

	Если ПараметрыJSON <> Неопределено Тогда
		СтрокаJSON = СтруктураВJSON(ПараметрыJSON);
		Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
	КонецЕсли;

	Ответ = Неопределено;

	Попытка
		Если ВидЗапроса = Перечисления.ВидHTTPЗапроса.GET Тогда
			Ответ = Соединение.Получить(Запрос);
		ИначеЕсли ВидЗапроса = Перечисления.ВидHTTPЗапроса.POST Тогда
			Ответ = Соединение.ОтправитьДляОбработки(Запрос);
		Иначе
			ВызватьИсключение("Неподдерживаемый вид HTTP-запроса", КатегорияОшибки.ОшибкаКонфигурации);
		КонецЕсли;
	Исключение
		ВызватьИсключение
	КонецПопытки;
	
	Если Ответ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КодСостояния = Ответ.КодСостояния;

	Если КодСостояния = 200 Тогда
		Возврат ПарсингJSON.ПолучитьЗначение(Ответ.ПолучитьТелоКакСтроку(), СоответствиеКлючей);
	ИначеЕсли КодСостояния = 204 Тогда
		Возврат Неопределено
	КонецЕсли;
	
	ОбработатьОшибку(Ответ);

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьОшибку(Ответ)
	
	Если Ответ = Неопределено Тогда
        Возврат
	КонецЕсли;
	
	КодОшибки = Ответ.КодСостояния;
	ТелоОшибки = Ответ.ПолучитьТелоКакСтроку();
	
	ОписаниеОшибки = Неопределено;
	
	Если КодОшибки >= 500 И КодОшибки < 600 Тогда
		ОписаниеОшибки = "Внутренняя ошибка сервера." + Символы.ПС
			+ "Сервис недоступен. Повторите запрос позже или обратитесь в техническую поддержку";
	Иначе
		СоответствиеОшибок = Новый Соответствие;
		СоответствиеОшибок.Вставить(208, "Такая загрузка уже есть.");
		СоответствиеОшибок.Вставить(400, "Неправильный запрос." + Символы.ПС 
			+ "Проверьте синтаксис запроса");
		СоответствиеОшибок.Вставить(401, "Пользователь не авторизован." + Символы.ПС 
			+ "Проверьте токен авторизации.
			|Категория токена должна совпадать с категорией API. Также токен может:" + Символы.ПС 
			+ "• быть просрочен" + Символы.ПС 
			+ "• быть некорректным" + Символы.ПС
			+ "• отсутствовать в запросе");
		СоответствиеОшибок.Вставить(402, "Требуется платёж." + Символы.ПС
			+ "Ошибка означает, что на балансе сервиса из Каталога недостаточно средств");
		СоответствиеОшибок.Вставить(403, "Доступ запрещён." + Символы.ПС 
			+ "Токен не должен быть сгенерирован удалённым пользователем.
			| Доступ к методу не должен быть заблокирован.
			| Если вы хотите использовать методы Джема, проверьте подписку в личном кабинете");
		СоответствиеОшибок.Вставить(404, "Не найдено." + Символы.ПС 
			+ "Проверьте URL запроса");
		СоответствиеОшибок.Вставить(409, "Ошибка сохранения для части ссылок/обновления
			| статуса/добавления сборочного задания/т.д." + Символы.ПС
			+ "Проверьте данные запроса. Они должны отвечать требованиям и ограничениям сервиса");
		СоответствиеОшибок.Вставить(413, "Превышен лимит объёма данных в запросе." + Символы.ПС
			+ "Уменьшите количество объектов в запросе");
		СоответствиеОшибок.Вставить(422, "Отсутствие в запросе параметра nmId/Размер ставки не изменен/т.д." + Символы.ПС
			+ "Проверьте данные запроса. Данные запроса не должны противоречить друг другу");
		СоответствиеОшибок.Вставить(429, "Слишком много запросов." + Символы.ПС
			+ "Проверьте лимиты запросов и повторите запрос позже");
	
		ОписаниеОшибки = СоответствиеОшибок.Получить(КодОшибки);
	КонецЕсли;

	Если ОписаниеОшибки = Неопределено Тогда
		ВызватьИсключение("Не известная ошибка." + Символы.ПС + "Код ошибки: " + КодОшибки,  
			КатегорияОшибки.ОшибкаКонфигурации, КодОшибки, ТелоОшибки);
	Иначе
		ВызватьИсключение(ОписаниеОшибки, , КодОшибки, ТелоОшибки)
	КонецЕсли;

КонецПроцедуры

Функция СтруктураВПараметрыURL(Структура)

	Результат = "";

	Для Каждого КлючЗначение Из Структура Цикл

		Если Результат <> "" Тогда
			Результат = Результат + "&";
		КонецЕсли;

		Значение = Строка(КлючЗначение.Значение);
		Результат = Результат + КлючЗначение.Ключ + "=" + Значение;
	КонецЦикла;

	Возврат Результат;
КонецФункции

Функция СтруктураВJSON(Структура)
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто));
	ЗаписатьJSON(ЗаписьJSON, Структура);
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

#КонецОбласти