
#Область ПрограммныйИнтерфейс

Функция ПолучитьСписокКатегорий(Токен) Экспорт

	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));

	СписокКатегорий = Новый Массив;

	Смещение = 0;
	Лимит = 1000;

	Пока Истина Цикл

		ДанныеAPI = ПолучитьКатегории(Токен, , , Смещение, Лимит);
		Категории = Неопределено;

		Если ДанныеAPI = Неопределено Тогда
			Прервать;
		КонецЕсли;

		Если Не ДанныеAPI.Свойство("data", Категории) Тогда
			Прервать;
		КонецЕсли;

		Для Каждого Элемент Из Категории Цикл
			СписокКатегорий.Добавить(Элемент);
		КонецЦикла;

		Если Категории.Количество() < Лимит Тогда
			Прервать;
		КонецЕсли;

		Смещение = Смещение + Лимит;

	КонецЦикла;

	Возврат СписокКатегорий;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьКатегории(Токен, ИДРодительскойКатегории = 0, Наименование = "", Смещение = 0, Лимит = 1000, Язык = "ru")
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Язык, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(Лимит, 1, 1000);
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(Смещение, 0);
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(ИДРодительскойКатегории, 0);
	
	АдресСервера = КлиентAPI.СерверКонтента();
	Путь = "/content/v2/object/all";
	
	ПараметрыЗапросаURL = Новый Структура;
	ПараметрыЗапросаURL.Вставить("locale", Язык);
	
	Если НЕ ПустаяСтрока(Наименование) Тогда
		ПараметрыЗапросаURL.Вставить("name", Наименование);
	КонецЕсли;
	
	ПараметрыЗапросаURL.Вставить("limit", Лимит);
	ПараметрыЗапросаURL.Вставить("offset", Смещение);
	
	Если ИДРодительскойКатегории > 0 Тогда
		ПараметрыЗапросаURL.Вставить("parentID", ИДРодительскойКатегории);
	КонецЕсли;
	
	Возврат КлиентAPI.ВыполнитьЗапрос(Токен, АдресСервера, Перечисления.ВидHTTPЗапроса.GET, Путь, ПараметрыЗапросаURL);
	
КонецФункции

Функция ПолучитьВсеКарточкиТоваров(Токен, Язык = "ru") Экспорт
	
	ВсеКарточкиТоваров = Новый Массив;
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Язык, Тип("Строка"));
	
	НачальнаяДата = Неопределено;
	НачальныйАртикулWB = Неопределено;
	Количество = 0;
	Лимит = 100;
	
	Пока Истина Цикл
		
		ДанныеAPI = ПолучитьКарточкиТоваров(Токен, НачальнаяДата, НачальныйАртикулWB, Лимит, Язык);
		
		КарточкиТоваров = Неопределено;
		Если ДанныеAPI.Свойство("cards", КарточкиТоваров) Тогда
			Для Каждого Элемент Из КарточкиТоваров Цикл
				ВсеКарточкиТоваров.Добавить(Элемент);
			КонецЦикла;
		КонецЕсли;
		
		Курсор = Неопределено;
		Если ДанныеAPI.Свойство("cursor", Курсор) Тогда
			Количество = Курсор.total;
			НачальнаяДата = Курсор.updatedAt;
			НачальныйАртикулWB = Курсор.nmID;
		КонецЕсли;
		
		Если Количество < Лимит Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВсеКарточкиТоваров;
	
КонецФункции

Функция ПолучитьКарточкиТоваров(Токен, НачальнаяДата = Неопределено, НачальныйАртикулWB = Неопределено, Лимит = 100, Язык = "ru") Экспорт
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Язык, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(Лимит, 1, 100);
	
	АдресСервера = КлиентAPI.СерверКонтента();
	Путь = "/content/v2/get/cards/list";
	
	ПараметрыЗапросаURL = Новый Структура;
	ПараметрыЗапросаURL.Вставить("locale", Язык);
	
	ПараметрыЗапросаJSON = Новый Структура;
	ПараметрыЗапросаJSONНастройки = Новый Структура;
	ПараметрыЗапросаJSONФильтр = Новый Структура;
	ПараметрыЗапросаJSONСортировка = Новый Структура;
	ПараметрыЗапросаJSONКурсор = Новый Структура;
	
	ПараметрыЗапросаJSON.Вставить("settings", ПараметрыЗапросаJSONНастройки);
	
	ПараметрыЗапросаJSONНастройки.Вставить("filter", ПараметрыЗапросаJSONФильтр);
	ПараметрыЗапросаJSONНастройки.Вставить("sort", ПараметрыЗапросаJSONСортировка);
	ПараметрыЗапросаJSONНастройки.Вставить("cursor", ПараметрыЗапросаJSONКурсор);
	
	ПараметрыЗапросаJSONФильтр.Вставить("withPhoto", -1);
	ПараметрыЗапросаJSONСортировка.Вставить("ascending", Истина);
	ПараметрыЗапросаJSONКурсор.Вставить("limit", Лимит);
	
	Если НачальнаяДата <> Неопределено Тогда
		ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(НачальнаяДата, Тип("Дата"));
		ПараметрыЗапросаJSONКурсор.Вставить("updatedAt", НачальнаяДата);
	КонецЕсли;
	
	Если НачальныйАртикулWB <> Неопределено Тогда
		ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(НачальныйАртикулWB, Тип("Число"));
		ПараметрыЗапросаJSONКурсор.Вставить("nmID", НачальныйАртикулWB);
	КонецЕсли;

	Возврат КлиентAPI.ВыполнитьЗапрос(Токен, АдресСервера, Перечисления.ВидHTTPЗапроса.POST, Путь, ПараметрыЗапросаURL, ПараметрыЗапросаJSON);
	
КонецФункции
#КонецОбласти