
#Область ПрограммныйИнтерфейс

Функция ПолучитьСписокПредметов(Токен, ИДРодительскойКатегории = 0, Наименование = "", Смещение = 0, Лимит = 1000, Язык = "ru") Экспорт
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Язык, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(Лимит, 1, 1000);
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(Смещение, 0);
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(ИДРодительскойКатегории, 0);
	
	АдресСервера = КлиентAPI.СерверКонтента();
	Путь = "/content/v2/object/all";
	
	ПараметрыЗапросаURL = Новый Структура;
	ПараметрыЗапросаURL.Вставить("locale", Язык);
	
	Если НЕ ПустаяСтрока(Наименование) Тогда
		ПараметрыЗапросаURL.Вставить("name", Наименование);
	КонецЕсли;
	
	ПараметрыЗапросаURL.Вставить("limit", Лимит);
	ПараметрыЗапросаURL.Вставить("offset", Смещение);
	
	Если ИДРодительскойКатегории > 0 Тогда
		ПараметрыЗапросаURL.Вставить("parentID", ИДРодительскойКатегории);
	КонецЕсли;
	
	
	
	Возврат КлиентAPI.ВыполнитьЗапрос(Токен, АдресСервера, Перечисления.ВидHTTPЗапроса.GET, Путь, ПараметрыЗапросаURL);
	
КонецФункции


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
