
#Область ПрограммныйИнтерфейс

Функция ПолучитьВсеКарточкиТоваров(Токен, Язык = "ru") Экспорт
	
	ВсеКарточкиТоваров = Новый Массив;
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Язык, Тип("Строка"));
	
	НачальнаяДата = Неопределено;
	НачальныйАртикулWB = Неопределено;
	Количество = 0;
	Лимит = 100;
	
	Пока Истина Цикл
		
		ДанныеAPI = ПолучитьКарточкиТоваров(Токен, НачальнаяДата, НачальныйАртикулWB, Лимит, Язык);
		
		КарточкиТоваров = Неопределено;
		Если ДанныеAPI.Свойство("cards", КарточкиТоваров) Тогда
			Для Каждого Элемент Из КарточкиТоваров Цикл
				ВсеКарточкиТоваров.Добавить(Элемент);
			КонецЦикла;
		КонецЕсли;
		
		Курсор = Неопределено;
		Если ДанныеAPI.Свойство("cursor", Курсор) Тогда
			Количество = Курсор.total;
			НачальнаяДата = Курсор.updatedAt;
			НачальныйАртикулWB = Курсор.nmID;
		КонецЕсли;
		
		Если Количество < Лимит Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВсеКарточкиТоваров;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьКарточкиТоваров(Токен, НачальнаяДата = Неопределено, НачальныйАртикулWB = Неопределено, Лимит = 100, Язык = "ru") Экспорт
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Язык, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(Лимит, 1, 100);
	
	АдресСервера = КлиентAPI.СерверКонтента();
	Путь = "/content/v2/get/cards/list";
	
	ПараметрыЗапросаURL = Новый Структура;
	ПараметрыЗапросаURL.Вставить("locale", Язык);
	
	ПараметрыЗапросаJSON = Новый Структура;
	ПараметрыЗапросаJSONНастройки = Новый Структура;
	ПараметрыЗапросаJSONФильтр = Новый Структура;
	ПараметрыЗапросаJSONСортировка = Новый Структура;
	ПараметрыЗапросаJSONКурсор = Новый Структура;
	
	ПараметрыЗапросаJSON.Вставить("settings", ПараметрыЗапросаJSONНастройки);
	
	ПараметрыЗапросаJSONНастройки.Вставить("filter", ПараметрыЗапросаJSONФильтр);
	ПараметрыЗапросаJSONНастройки.Вставить("sort", ПараметрыЗапросаJSONСортировка);
	ПараметрыЗапросаJSONНастройки.Вставить("cursor", ПараметрыЗапросаJSONКурсор);
	
	ПараметрыЗапросаJSONФильтр.Вставить("withPhoto", -1);
	ПараметрыЗапросаJSONСортировка.Вставить("ascending", Истина);
	ПараметрыЗапросаJSONКурсор.Вставить("limit", Лимит);
	
	Если НачальнаяДата <> Неопределено Тогда
		ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(НачальнаяДата, Тип("Дата"));
		ПараметрыЗапросаJSONКурсор.Вставить("updatedAt", НачальнаяДата);
	КонецЕсли;
	
	Если НачальныйАртикулWB <> Неопределено Тогда
		ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(НачальныйАртикулWB, Тип("Число"));
		ПараметрыЗапросаJSONКурсор.Вставить("nmID", НачальныйАртикулWB);
	КонецЕсли;

	ДанныеAPI = КлиентAPI.ВыполнитьЗапрос(Токен, АдресСервера, Перечисления.ВидHTTPЗапроса.POST, Путь, ПараметрыЗапросаURL, ПараметрыЗапросаJSON);
	
	Возврат МаппингЗначений.ПрименитьМаппинг(ДанныеAPI, ПолучитьПараметрыМаппинга());;
	
КонецФункции

Функция ПолучитьПараметрыМаппинга()
	
	ПараметрыМаппинга = Новый Структура;
	// Артикул WB
	ПараметрыМаппинга.Вставить("nmID", Новый Структура("ИмяКлюча, ТипЗначения", "АртикулWB", Тип("Число")));
	// ID для объединённых карточек товаров
	ПараметрыМаппинга.Вставить("imtID", Новый Структура("ИмяКлюча, ТипЗначения", "ИдОбъединеннойКарточки", Тип("Число")));
	// Внутренний технический ID карточки товара
	ПараметрыМаппинга.Вставить("nmUUID", Новый Структура("ИмяКлюча, ТипЗначения", "ИдВнутренний", Тип("Строка")));
	// ID предмета
	ПараметрыМаппинга.Вставить("subjectID", Новый Структура("ИмяКлюча, ТипЗначения", "ИдКатегории", Тип("Число")));
	// Название предмета
	ПараметрыМаппинга.Вставить("subjectName", Новый Структура("ИмяКлюча, ТипЗначения", "НаименованиеКатегории", Тип("Строка")));
	// Артикул продавца
	ПараметрыМаппинга.Вставить("vendorCode", Новый Структура("ИмяКлюча, ТипЗначения", "АртикулПродавца", Тип("Строка")));
	// Бренд
	ПараметрыМаппинга.Вставить("brand", Новый Структура("ИмяКлюча, ТипЗначения", "Бренд", Тип("Строка")));
	// Наименование товараы
	ПараметрыМаппинга.Вставить("title", Новый Структура("ИмяКлюча, ТипЗначения", "Наименование", Тип("Строка")));
	// Описание товара
	ПараметрыМаппинга.Вставить("description", Новый Структура("ИмяКлюча, ТипЗначения", "Описание", Тип("Строка")));
	// Требуется ли код маркировки
	ПараметрыМаппинга.Вставить("needKiz", Новый Структура("ИмяКлюча, ТипЗначения", "ТребуетсяКодМаркировки", Тип("Булево")));
	// Есть ли подтверждение о нанесении кода маркировки
	ПараметрыМаппинга.Вставить("kizMarked", Новый Структура("ИмяКлюча, ТипЗначения", "КодМаркировкиНанесен", Тип("Булево")));
	// Массив фото
	ПараметрыМаппинга.Вставить("photos", Новый Структура(
		"ИмяКлюча, ТипЗначения, ПараметрыМаппинга", 
		"Медиафайлы", Тип("Структура"), ПолучитьПараметрыМаппингаФото()));
	// Оптовая продажа
	ПараметрыМаппинга.Вставить("wholesale", Новый Структура(
		"ИмяКлюча, ТипЗначения, ПараметрыМаппинга", 
		"ОптоваяПродажа", Тип("Структура"), ПолучитьПараметрыМаппингаОпт()));
	// Габариты и вес товара
	ПараметрыМаппинга.Вставить("dimensions", Новый Структура(
		"ИмяКлюча, ТипЗначения, ПараметрыМаппинга", 
		"Габариты", Тип("Структура"), ПолучитьПараметрыМаппингаГабариты()));
	// Характеристики
	ПараметрыМаппинга.Вставить("characteristics", Новый Структура(
		"ИмяКлюча, ТипЗначения, ПараметрыМаппинга", 
		"Характеристики", Тип("Структура"), ПолучитьПараметрыМаппингаХарактеристики()));
	// Размеры товара
	ПараметрыМаппинга.Вставить("sizes", Новый Структура(
		"ИмяКлюча, ТипЗначения, ПараметрыМаппинга", 
		"Размеры", Тип("Структура"), ПолучитьПараметрыМаппингаРазмеры()));
	// Ярлыки
	ПараметрыМаппинга.Вставить("tags", Новый Структура(
		"ИмяКлюча, ТипЗначения, ПараметрыМаппинга", 
		"Ярлыки", Тип("Структура"), ПолучитьПараметрыМаппингаЯрлыки()));
	// Дата и время создания
	ПараметрыМаппинга.Вставить("createdAt", Новый Структура("ИмяКлюча, ТипЗначения", "ДатаСоздания", Тип("Дата")));
	// Дата и время изменения
	ПараметрыМаппинга.Вставить("updatedAt", Новый Структура("ИмяКлюча, ТипЗначения", "ДатаИзменения", Тип("Дата")));
	
	Возврат ПараметрыМаппинга;
	
КонецФункции

Функция ПолучитьПараметрыМаппингаФото()
	
	Параметры = Новый Структура;
	// URL фото 900x1200
	Параметры.Вставить("big", Новый Структура("ИмяКлюча, ТипЗначения", "ФотоБольшое", Тип("Строка")));
	// URL фото 248x328
	Параметры.Вставить("c246x328", Новый Структура("ИмяКлюча, ТипЗначения", "ФотоМалое", Тип("Строка")));
	// URL фото 516x688
	Параметры.Вставить("c516x688", Новый Структура("ИмяКлюча, ТипЗначения", "ФотоСреднее", Тип("Строка")));
	// URL фото 600x600
	Параметры.Вставить("square", Новый Структура("ИмяКлюча, ТипЗначения", "ФотоКвадрат", Тип("Строка")));
	// URL фото 75x100
	Параметры.Вставить("tm", Новый Структура("ИмяКлюча, ТипЗначения", "ФотоМиниатюра", Тип("Строка")));
	// URL видео
	Параметры.Вставить("video", Новый Структура("ИмяКлюча, ТипЗначения", "Видео", Тип("Строка")));
	
	Возврат Параметры;
	
КонецФункции

Функция ПолучитьПараметрыМаппингаОпт()
	
	Параметры = Новый Структура;
	// Предназначена ли карточка для оптовой продажи
	Параметры.Вставить("enabled", Новый Структура("ИмяКлюча, ТипЗначения", "ОптовыеПродажи", Тип("Булево")));
	// Количество единиц товара в упаковке
	Параметры.Вставить("quantum", Новый Структура("ИмяКлюча, ТипЗначения", "КоличествоВУпаковке", Тип("Число")));
	
	Возврат Параметры;
	
КонецФункции

Функция ПолучитьПараметрыМаппингаГабариты()
	
	Параметры = Новый Структура;
	// Длина, см
	Параметры.Вставить("length", Новый Структура("ИмяКлюча, ТипЗначения", "Длина", Тип("Число")));
	// Ширина, см
	Параметры.Вставить("width", Новый Структура("ИмяКлюча, ТипЗначения", "Ширина", Тип("Число")));
	// Высота, см
	Параметры.Вставить("height", Новый Структура("ИмяКлюча, ТипЗначения", "Высота", Тип("Число")));
	// Вес, кг
	Параметры.Вставить("weightBrutto", Новый Структура("ИмяКлюча, ТипЗначения", "ВесБрутто", Тип("Число")));
	
	Возврат Параметры;
	
КонецФункции

Функция ПолучитьПараметрыМаппингаХарактеристики()
	
	Параметры = Новый Структура;
	// ID характеристики
	Параметры.Вставить("id", Новый Структура("ИмяКлюча, ТипЗначения", "Ид", Тип("Число")));
	// Название характеристики
	Параметры.Вставить("name", Новый Структура("ИмяКлюча, ТипЗначения", "Наименование", Тип("Строка")));
	// Значение характеристики
	Параметры.Вставить("value", Новый Структура("ИмяКлюча, ТипЗначения", "Значение", Тип("Строка")));
	
	Возврат Параметры;
	
КонецФункции

Функция ПолучитьПараметрыМаппингаРазмеры()
	
	Параметры = Новый Структура;
	// Числовой ID размера
	Параметры.Вставить("chrtID", Новый Структура("ИмяКлюча, ТипЗначения", "Ид", Тип("Число")));
	// Размер товара
	Параметры.Вставить("techSize", Новый Структура("ИмяКлюча, ТипЗначения", "Размер", Тип("Строка")));
	// Российский размер
	Параметры.Вставить("wbSize", Новый Структура("ИмяКлюча, ТипЗначения", "РазмерРФ", Тип("Строка")));
	// Баркоды
	Параметры.Вставить("skus", Новый Структура("ИмяКлюча, ТипЗначения", "Баркоды", Тип("Строка")));
	
	Возврат Параметры;
	
КонецФункции

Функция ПолучитьПараметрыМаппингаЯрлыки()
	
	Параметры = Новый Структура;
	// ID ярлыка
	Параметры.Вставить("id", Новый Структура("ИмяКлюча, ТипЗначения", "Ид", Тип("Число")));
	// Название ярлыка
	Параметры.Вставить("name", Новый Структура("ИмяКлюча, ТипЗначения", "Наименование", Тип("Строка")));
	// Цвет ярлыка
	Параметры.Вставить("color", Новый Структура("ИмяКлюча, ТипЗначения", "Цвет", Тип("Строка")));
	
	Возврат Параметры;
	
КонецФункции


#КонецОбласти