
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВыбратьДатуПоследнегоДокумента(Продавец) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Поставки.Дата КАК Дата
	|ИЗ
	|	Документ.Поставки КАК Поставки
	|ГДЕ
	|	Поставки.Продавец = &Продавец
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Продавец", Продавец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Дата;
	
КонецФункции

Процедура ЗагрузитьВсе() Экспорт
	
	Продавцы = Справочники.Продавцы.ВыбратьВсехПродавцов();
	
	Для Каждого Продавец Из Продавцы Цикл
		ЗагрузитьПоПродавцу(Продавец);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьПоПродавцу(Продавец) Экспорт
	
	НачалоПериода = ПолучитьНачалоПериодаЗагрузки(Продавец);
	Загрузить(Продавец, НачалоПериода);
	
КонецПроцедуры

Процедура Загрузить(Продавец, НачалоПериода, КонецПериода = Неопределено) Экспорт
	
	Если КонецПериода = Неопределено Тогда
		КонецПериода = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Токен = Справочники.Продавцы.ПолучитьТокен(Продавец);
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Продавец, Тип("СправочникСсылка.Продавцы"));
	
	ДанныеAPI = ПоставкиAPI.ПолучитьВсеПоставки(Токен, НачалоПериода, КонецПериода);
	
	Если ДанныеAPI = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ДанныеAPIПоставки Из ДанныеAPI Цикл
		
		Ид = Неопределено;
		ЭтоИдЗаказа = Неопределено;
		
		Если ЗначениеЗаполнено(ДанныеAPIПоставки.ИдПоставки) Тогда
			Ид = ДанныеAPIПоставки.ИдПоставки;
			ЭтоИдЗаказа = Ложь;
		Иначе
			Ид = ДанныеAPIПоставки.ИдЗаказа;
			ЭтоИдЗаказа = Истина;
		КонецЕсли;
		
		ДанныеAPIТоваров = ПоставкиAPI.ПолучитьВсеТоварыПоставки(Токен, Ид, ЭтоИдЗаказа);
		ОбновитьИлиСоздать(Продавец, ДанныеAPIПоставки, ДанныеAPIТоваров);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбновитьИлиСоздать(Продавец, ДанныеAPIПоставки, ДанныеAPIТоваров)
	
	Объект = Неопределено;
	Ссылка = НайтиПоРеквизиту("ИдЗаказа", ДанныеAPIПоставки.ИдЗаказа);
	
	Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
		Объект = СоздатьДокумент();
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	Объект.Продавец = Продавец;
	ЗаполнитьПоставкуИзДанныхAPI(Объект, ДанныеAPIПоставки);
	ЗаполнитьТоварыИзДанныхAPI(Объект, ДанныеAPIТоваров);
	
	Объект.Записать();
	Возврат Объект;
	
КонецФункции

Процедура ЗаполнитьПоставкуИзДанныхAPI(Объект, ДанныеAPI)
	
	Объект.Дата = ДанныеAPI.ДатаСоздания;
	Объект.Телефон = ДанныеAPI.Телефон;
	Объект.ИдПоставки = ДанныеAPI.ИдПоставки;
	Объект.ИдЗаказа = ДанныеAPI.ИдЗаказа;
	Объект.ДатаОтгрузкиПлановая = ДанныеAPI.ДатаОтгрузкиПлановая;
	Объект.ДатаОтгрузкиФактическая = ДанныеAPI.ДатаОтгрузкиФактическая;
	Объект.ДатаИзменения = ДанныеAPI.ДатаИзменения;
	Объект.Статус = Перечисления.СтатусыПоставки.ПолучитьПоИд(ДанныеAPI.ИдСтатуса);
	Объект.ТипПоставки = Перечисления.ТипыПоставки.ПолучитьПоИд(ДанныеAPI.ИдТипаПоставки);
	
	Если ДанныеAPI.Свойство("ПоштучнаяПалета") Тогда
		Объект.ПоштучнаяПалета = ДанныеAPI.ПоштучнаяПалета;
	КонецЕсли;

КонецПроцедуры

Функция ЗаполнитьТоварыИзДанныхAPI(Объект, ДанныеAPI)
	
	Объект.Товары.Очистить();
	
	Для Каждого ЭлементAPI Из ДанныеAPI Цикл
		
		КарточкаТовара = Справочники.КарточкиТоваров.НайтиПоРеквизиту("АртикулWB", ЭлементAPI.АртикулWB);
		Размер = Справочники.РазмерыКарточекТоваров.НайтиПоРеквизиту("Размер", ЭлементAPI.Размер, , КарточкаТовара);
		
		Если КарточкаТовара = Неопределено ИЛИ Размер = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Стр = Объект.Товары.Добавить();
		Стр.КарточкаТовара = КарточкаТовара;
		Стр.Размер = Размер;
		Стр.КоличествоВПоставке = ЭлементAPI.КоличествоВПоставке;
		Стр.КоличествоПринято = ЭлементAPI.КоличествоПринято;
		Стр.КоличествоПоступилоВПродажу = ЭлементAPI.КоличествоПоступилоВПродажу;
		Стр.КоличествоВУпаковке = ЭлементAPI.КоличествоВУпаковке;
		Стр.КоличествоНаРаскладке = ЭлементAPI.КоличествоНаРаскладке;
		
	КонецЦикла;
КонецФункции

Функция ПолучитьНачалоПериодаЗагрузки(Продавец)
	
	ДатаПоследнегоДокумента = ВыбратьДатуПоследнегоДокумента(Продавец);
	
	Если ДатаПоследнегоДокумента <> Неопределено Тогда
		Возврат ДатаПоследнегоДокумента;
	КонецЕсли;
	
	Возврат Справочники.Продавцы.ПолучитьДатуРегистрации(Продавец);

КонецФункции

#КонецОбласти

#КонецЕсли
