Процедура ОбработкаПроведения(Отказ,Режим)

	Движения.СебестоимостьКарточекТоваров.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары из Товары Цикл
		Движение = Движения.СебестоимостьКарточекТоваров.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Продавец = Продавец;
		Движение.КарточкаТовара = ТекСтрокаТовары.КарточкаТовара;
		Движение.Размер = ТекСтрокаТовары.Размер;
		Движение.Поставка = Ссылка;
		Движение.Статья = Справочники.СтатьиКалькуляции.ЗакупкаТовара;
		Движение.Количество = ТекСтрокаТовары.КоличествоПоступилоВПродажу;
		Движение.Сумма = ТекСтрокаТовары.ЦенаЗакупки * ТекСтрокаТовары.КоличествоПоступилоВПродажу;
	КонецЦикла;

КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
