Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ДоходыИРасходы
	Движения.ДоходыИРасходы.Записывать = Истина;
	
	Для Каждого ТекСтрокаДоходыИРасходы Из ДоходыИРасходы Цикл
		Движение = Движения.ДоходыИРасходы.Добавить();
		Движение.Период = Дата;
		Движение.Продавец = Продавец;
		Движение.КарточкаТовара = ТекСтрокаДоходыИРасходы.КарточкаТовара;
		Движение.Размер = ТекСтрокаДоходыИРасходы.Размер;
		Движение.ЗаказПокупателя = ТекСтрокаДоходыИРасходы.ЗаказПокупателя;
		Движение.Статья = ТекСтрокаДоходыИРасходы.Статья;
		
		Если Движение.Статья.ВидСтатьи = Перечисления.ВидыСтатей.Доход Тогда
			Движение.СуммаДохода = ТекСтрокаДоходыИРасходы.Сумма;
		ИначеЕсли Движение.Статья.ВидСтатьи = Перечисления.ВидыСтатей.Расход Тогда
			Движение.СуммаРасхода = ТекСтрокаДоходыИРасходы.Сумма;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
