// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗагрузитьКарточкиТоваров(Команда)
	ЗагрузитьКарточкиТоваровНаСервере();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Процедура ЗагрузитьКарточкиТоваровНаСервере()
	Справочники.КарточкиТоваров.ЗагрузитьВсе();
КонецПроцедуры
#КонецОбласти

