#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПолучитьИнформациюОПродавце(Команда)

	Токен = "eyJhbGciOiJFUzI1NiIsImtpZCI6IjIwMjYwMzAydjEiLCJ0eXAiOiJKV1QifQ.eyJhY2MiOjEsImVudCI6MSwiZXhwIjoxNzkxNzQzNzA0LCJpZCI6IjAxOWQ4MDY2LWE5M2QtN2YzMi05ZDU5LTQzZmZkOTE0YjQwOSIsImlpZCI6Mjg1NTYzNjEsIm9pZCI6MTg2Mzc0LCJzIjoxNjEyNiwic2lkIjoiMWYxY2NhMzQtMzJhZS00OTZmLWFlYzQtNzk2NWI1NDQ5ZDJiIiwidCI6ZmFsc2UsInVpZCI6Mjg1NTYzNjF9.l7byj1AZPkpRBsr6z0cTiY3IGz89EY_XNl4_LeMM1fsFrkoLwk4qrQRAmWzpK7aozEwJoiFued5rTzYfUvQC9A";

	ИнформацияОПродавце = ИнформацияОПродавцеAPI.ПолучитьИнформациюОПродавце(Токен);

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СоответствиеВСтроку(ИнформацияОПродавце);
	Сообщение.Сообщить();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция СоответствиеВСтроку(Соответствие)

	Результат = "";

	Для Каждого КлючИЗначение Из Соответствие Цикл
		Результат = Результат + КлючИЗначение.Ключ + " = " + КлючИЗначение.Значение + Символы.ПС;
	КонецЦикла;

	Возврат Результат;
КонецФункции
#КонецОбласти