// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗагрузитьОтчетыРеализации(Команда)
	ЗагрузитьОтчетыРеализацииНаСервере(Объект.Продавец, Объект.НачалоПериода, Объект.КонецПериода);
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Процедура ЗагрузитьОтчетыРеализацииНаСервере(Продавец, НачалоПериода, КонецПериода)
	
	Документы.ОтчетРеализации.Загрузить(Продавец, НачалоПериода, КонецПериода);
	
КонецПроцедуры
#КонецОбласти

