
#Область ПрограммныйИнтерфейс

Функция ОтправитьСообщение(ТекстСообщения, ИИАгент) Экспорт
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(ТекстСообщения, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(ИИАгент, Тип("СправочникСсылка.ИИАгенты"));
	
	ИИАгентОбъект = ИИАгент.ПолучитьОбъект();
	
	// Формируем JSON тело запроса
	ТелоJSON = Новый Структура;
	ПромтJSON = Новый Структура;
	
	ПромтJSON.Вставить("id", ИИАгентОбъект.ИдАгента);
	
	ТелоJSON.Вставить("prompt", ПромтJSON);
	ТелоJSON.Вставить("input", ТекстСообщения);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ТелоJSON);
	СтрокаJSON = ЗаписьJSON.Закрыть();

	// Создаем HTTP запрос
	HTTPЗапрос = Новый HTTPЗапрос("/v1/responses");
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Api-Key " + ИИАгентОбъект.КлючAPI);
	HTTPЗапрос.Заголовки.Вставить("OpenAI-Project", ИИАгентОбъект.ИдКаталога);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON, "utf-8");

	// Создаем HTTP соединение
	HTTPСоединение = Новый HTTPСоединение("ai.api.cloud.yandex.net", , , , , , Новый ЗащищенноеСоединениеOpenSSL);
	Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);

	Если Ответ.КодСостояния = 200 Тогда
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		Возврат ТелоОтвета;
	КонецЕсли;
	
	ВызватьИсключение("Ошибка: " + Ответ.КодСостояния + "/n" + Ответ.ПолучитьТелоКакСтроку());
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
