// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура НайтиПоИдПоставки(Команда)
	Поставка = НайтиПоИдПоставкиНаСервере(Объект.ИдПоставки);
	Сообщить(Строка(Поставка));
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Функция НайтиПоИдПоставкиНаСервере(ИдПоставки)
	Возврат Документы.Поставки.НайтиПоИдПоставки(ИдПоставки);
КонецФункции
#КонецОбласти

