#Область ПрограммныйИнтерфейс

Функция ПолучитьЗначение(СтрокаJSON, СоответствиеКлючей = Неопределено) Экспорт
	
	Если не ЗначениеЗаполнено(СтрокаJSON) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);

	Попытка
		Данные = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		ЧтениеJSON.Закрыть();
		ВызватьИсключение("Ошибка чтения JSON", КатегорияОшибки.ОшибкаВнешнегоИсточникаДанных);
	КонецПопытки;

	ЧтениеJSON.Закрыть();

	Если СоответствиеКлючей <> Неопределено Тогда
		Данные = ЗаменитьКлючиВСтруктуре(Данные, СоответствиеКлючей);
	КонецЕсли;

	Возврат Данные;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаменитьКлючиВСтруктуре(ИсходнаяСтруктура, СоответствиеКлючей)

	Если ИсходнаяСтруктура = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	ТипИсходного = ТипЗнч(ИсходнаяСтруктура);

	Если ТипИсходного = Тип("Структура") Или ТипИсходного = Тип("ФиксированнаяСтруктура") Тогда
		
		Результат = Новый Структура;

		Для Каждого КлючЗначение Из ИсходнаяСтруктура Цикл
			ИсходныйКлюч = КлючЗначение.Ключ;
			Значение = КлючЗначение.Значение;

			НовоеИмяКлюча = ПолучитьУнифицированныйКлюч(СоответствиеКлючей, ИсходныйКлюч);

			Результат.Вставить(НовоеИмяКлюча, ЗаменитьКлючиВСтруктуре(Значение, СоответствиеКлючей));
		КонецЦикла;

		Если ТипИсходного = Тип("ФиксированнаяСтруктура") Тогда
			Возврат Новый ФиксированнаяСтруктура(Результат);
		КонецЕсли;

		Возврат Результат;

	ИначеЕсли ТипИсходного = Тип("Массив") Или ТипИсходного = Тип("ФиксированныйМассив") Тогда
		Результат = Новый Массив;

		Для Каждого Элемент Из ИсходнаяСтруктура Цикл
			Результат.Добавить(ЗаменитьКлючиВСтруктуре(Элемент, СоответствиеКлючей));
		КонецЦикла;

		Если ТипИсходного = Тип("ФиксированныйМассив") Тогда
			Возврат Новый ФиксированныйМассив(Результат);
		КонецЕсли;

		Возврат Результат;

	Иначе
		Возврат ИсходнаяСтруктура;
	КонецЕсли;

КонецФункции

Функция ПолучитьУнифицированныйКлюч(СоответствиеКлючей, ИсходныйКлюч)

	УнифицированныйКлюч = Неопределено;

	Если СоответствиеКлючей <> Неопределено И СоответствиеКлючей.Свойство(ИсходныйКлюч, УнифицированныйКлюч) Тогда
		Возврат УнифицированныйКлюч;
	КонецЕсли;

	Возврат ИсходныйКлюч;

КонецФункции

#КонецОбласти