
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьВсе() Экспорт
	
	Токен = КлиентAPI.ПолучитьТокенAPI();
	
	ДанныеAPI = КатегорииТоваровAPI.ПолучитьВсеКатегории(Токен);
	
	Если ДанныеAPI = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементAPI Из ДанныеAPI Цикл
		ОбновитьИлиСоздать(ЭлементAPI);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбновитьИлиСоздать(ДанныеAPI)
	
	Группа = ОбновитьИлиСоздатьГруппу(ДанныеAPI);
	
	Объект = Неопределено;
	Ссылка = НайтиПоРеквизиту("Ид", ДанныеAPI.ИдЭлемента, Группа);
	
	Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
		Объект = СоздатьЭлемент();
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	Объект.Родитель = Группа;
	Объект.Ид = ДанныеAPI.ИдЭлемента;
	Объект.Наименование = ДанныеAPI.НаименованиеЭлемента;
	
	Объект.Записать();
	Возврат Объект.Ссылка;
	
КонецФункции

Функция ОбновитьИлиСоздатьГруппу(ДанныеAPI)
	
	Объект = Неопределено;
	Ссылка = НайтиПоРеквизиту("Ид", ДанныеAPI.ИдГруппы);
	
	Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
		Объект = СоздатьГруппу();
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	Объект.Ид = ДанныеAPI.ИдГруппы;
	Объект.Наименование = ДанныеAPI.НаименованиеГруппы;
	
	Объект.Записать();
	Возврат Объект.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
