
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьВсе() Экспорт
	
	Токен = КлиентAPI.ПолучитьТокенAPI();
	
	ДанныеAPI = КарточкиТоваровAPI.ПолучитьСписокКатегорий(Токен);
	ДанныеAPI = МаппингЗначений.ПрименитьМаппинг(ДанныеAPI, ПолучитьПараметрыМаппинга());
	
	Если ДанныеAPI = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементAPI Из ДанныеAPI Цикл
		ОбновитьИлиСоздать(ЭлементAPI);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбновитьИлиСоздать(ДанныеAPI)
	
	Группа = ОбновитьИлиСоздатьГруппу(ДанныеAPI);
	
	Объект = Неопределено;
	Ссылка = НайтиПоКоду(ДанныеAPI.КодЭлемента, Истина, Группа);
	
	Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
		Объект = СоздатьЭлемент();
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	Объект.Родитель = Группа;
	Объект.Код = ДанныеAPI.КодЭлемента;
	Объект.Наименование = ДанныеAPI.НаименованиеЭлемента;
	
	Объект.Записать();
	Возврат Объект.Ссылка;
	
КонецФункции

Функция ОбновитьИлиСоздатьГруппу(ДанныеAPI)
	
	Объект = Неопределено;
	Ссылка = НайтиПоКоду(ДанныеAPI.КодГруппы, Истина);
	
	Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
		Объект = СоздатьГруппу();
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	Объект.Код = ДанныеAPI.КодГруппы;
	Объект.Наименование = ДанныеAPI.НаименованиеГруппы;
	
	Объект.Записать();
	Возврат Объект.Ссылка;
	
КонецФункции

Функция ПолучитьПараметрыМаппинга() Экспорт
	
	ПараметрыМаппинга = Новый Структура;
	// ID предмета
	ПараметрыМаппинга.Вставить("subjectID", Новый Структура("ИмяКлюча, ТипЗначения", "КодЭлемента", Тип("Число")));
	// ID родительской категории
	ПараметрыМаппинга.Вставить("parentID", Новый Структура("ИмяКлюча, ТипЗначения", "КодГруппы", Тип("Число")));
	// Название предмета
	ПараметрыМаппинга.Вставить("subjectName", Новый Структура("ИмяКлюча, ТипЗначения", "НаименованиеЭлемента", Тип("Строка")));
	// Название родительской категории
	ПараметрыМаппинга.Вставить("parentName", Новый Структура("ИмяКлюча, ТипЗначения", "НаименованиеГруппы", Тип("Строка")));
	
	Возврат ПараметрыМаппинга;
	
КонецФункции

#КонецОбласти

#КонецЕсли
