
#Область ПрограммныйИнтерфейс

Функция ПрименитьМаппинг(Данные, ПараметрыМаппинга, ПараметрыМаппингаЗначения = Неопределено) Экспорт
	
	Если Данные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТипДанных = ТипЗнч(Данные);

	Если ТипДанных = Тип("Структура") Или ТипДанных = Тип("ФиксированнаяСтруктура") Тогда
		
		Результат = Новый Структура;

		Для Каждого КлючИЗначение Из Данные Цикл
			
			Если ПараметрыМаппинга <> Неопределено И ПараметрыМаппинга.Свойство(КлючИЗначение.Ключ, ПараметрыМаппингаЗначения) Тогда
				НовоеЗначение = ПрименитьМаппинг(КлючИЗначение.Значение, ПараметрыМаппинга, ПараметрыМаппингаЗначения);
				Результат.Вставить(ПараметрыМаппингаЗначения.ИмяКлюча, НовоеЗначение);
			Иначе
				Результат.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			КонецЕсли;
			
		КонецЦикла;

		Возврат Результат;

	ИначеЕсли ТипДанных = Тип("Массив") Или ТипДанных = Тип("ФиксированныйМассив") Тогда
		
		Результат = Новый Массив;

		Для Каждого Элемент Из Данные Цикл
			Результат.Добавить(ПрименитьМаппинг(Элемент, ПараметрыМаппинга));
		КонецЦикла;

		Возврат Результат;

	Иначе
		
		Если ПараметрыМаппингаЗначения <> Неопределено Тогда
			Возврат ПрименитьМаппингКЗначению(Данные, ПараметрыМаппингаЗначения);
		КонецЕсли;
		
		Возврат Данные;
		
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПрименитьМаппингКЗначению(Значение, ПараметрыМаппингаЗначения) Экспорт
	
	Если ПараметрыМаппингаЗначения = Неопределено ИЛИ Значение = Неопределено 
	ИЛИ ПараметрыМаппингаЗначения.ТипЗначения = Неопределено ИЛИ ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Значение;
	КонецЕсли;
	
	ТипЗначения = ПараметрыМаппингаЗначения.ТипЗначения;
	
	Если ТипЗначения = Тип("Дата") Тогда
		Возврат ПрочитатьДатуJSON(Значение, ФорматДатыJSON.ISO);
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		Возврат Число(Значение);
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда
		Возврат Строка(Значение);
	Иначе
		Возврат Значение;
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
