
#Область ПрограммныйИнтерфейс

Функция ПолучитьСписокСкладов(Токен) Экспорт
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	
	АдресСервера = КлиентAPI.СерверПоставок();
	Путь = "/api/v1/warehouses";
	
	ДанныеAPI = КлиентAPI.ВыполнитьЗапрос(Токен, АдресСервера, Перечисления.ТипыHTTPЗапроса.GET, Путь);
	
	Возврат МаппингЗначений.ПрименитьМаппинг(ДанныеAPI, ПолучитьПараметрыМаппинга());
	
КонецФункции


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПараметрыМаппинга()
	
	ПараметрыМаппинга = Новый Структура;
	// ID склада
	ПараметрыМаппинга.Вставить("ID", Новый Структура("ИмяКлюча, ТипЗначения", "Код", Тип("Число")));
	// Название склада
	ПараметрыМаппинга.Вставить("name", Новый Структура("ИмяКлюча, ТипЗначения", "Наименование", Тип("Строка")));
	// Адрес склада
	ПараметрыМаппинга.Вставить("address", Новый Структура("ИмяКлюча, ТипЗначения", "Адрес", Тип("Строка")));
	// Режим работы склада
	ПараметрыМаппинга.Вставить("workTime", Новый Структура("ИмяКлюча, ТипЗначения", "РежимРаботы", Тип("Строка")));
	// Доступен ли в качестве склада назначения
	ПараметрыМаппинга.Вставить("isActive", Новый Структура("ИмяКлюча, ТипЗначения", "ДоступноНазначение", Тип("Булево")));
	// Доступен ли в качестве транзитного склада
	ПараметрыМаппинга.Вставить("isTransitActive", Новый Структура("ИмяКлюча, ТипЗначения", "ДоступенТранзит", Тип("Булево")));
	
	Возврат ПараметрыМаппинга;
	
КонецФункции

#КонецОбласти
