
#Область ПрограммныйИнтерфейс

Процедура ПроверитьЗначениеЗаполнено(Значение, Тип = Неопределено) Экспорт
	
	Если Тип <> Неопределено Тогда
		Если ТипЗнч(Тип) <> Тип("Тип") Тогда
			ВызватьИсключение(СтрШаблон("Тип '%1' должно имет тип Тип", Тип),
			КатегорияОшибки.ОшибкаКонфигурации);
		ИначеЕсли ТипЗнч(Значение) <> Тип Тогда
			ВызватьИсключение(СтрШаблон("Значение '%1' должно имет тип '%2'", Значение, Тип),
			КатегорияОшибки.ОшибкаКонфигурации);
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		ВызватьИсключение(СтрШаблон("Значение '%1' должно быть заполненно", Значение),
		КатегорияОшибки.ОшибкаКонфигурации);
	КонецЕсли;
	 
КонецПроцедуры

Процедура ПроверитьЧисло(Значение, Мин = Неопределено, Макс = Неопределено) Экспорт
	
	ПроверитьЗначениеЗаполнено(Значение, Тип("Число"));
	
	Если Мин <> Неопределено Тогда
		ПроверитьЧисло(Мин);
		Если Значение < Мин Тогда
			ВызватьИсключение(СтрШаблон("Значение '%1' должно быть >= '%2'", Значение, Мин),
			КатегорияОшибки.ОшибкаКонфигурации);
		КонецЕсли;
	КонецЕсли;
	
	Если Макс <> Неопределено Тогда
		ПроверитьЧисло(Макс);
		Если Значение > Макс Тогда
			ВызватьИсключение(СтрШаблон("Значение '%1' должно быть <= '%2'", Значение, Макс),
			КатегорияОшибки.ОшибкаКонфигурации);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПериод(НачалоПериода, КонецПериода) Экспорт
	
	ПроверитьЗначениеЗаполнено(НачалоПериода, Тип("Дата"));
	ПроверитьЗначениеЗаполнено(КонецПериода, Тип("Дата"));
	
	Если НачалоПериода > КонецПериода Тогда
		ВызватьИсключение(СтрШаблон(
			"Начало периода '%1' должно быть меньше конца периода '%2'", НачалоПериода, КонецПериода),
			КатегорияОшибки.ОшибкаКонфигурации);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
