
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВыбратьПоСтатье(Статья) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СтатьиРасходовВЗаказах.Статья КАК Статья,
		|	СтатьиРасходовВЗаказах.ЗаказОтменен КАК ЗаказОтменен
		|ИЗ
		|	РегистрСведений.СтатьиРасходовВЗаказах КАК СтатьиРасходовВЗаказах
		|ГДЕ
		|	СтатьиДРВЗаказах.Статья = &Статья";
	
	Запрос.УстановитьПараметр("Статья", Статья);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Новый Структура("Статья, ЗаказОтменен", ВыборкаДетальныеЗаписи.Статья, ВыборкаДетальныеЗаписи.ЗаказОтменен);
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
