
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьВсе() Экспорт
	
	Продавцы = Справочники.Продавцы.ВыбратьВсехПродавцов();
	
	Для Каждого Продавец Из Продавцы Цикл
		ЗагрузитьВсеПоПродавцу(Продавец);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьВсеПоПродавцу(Продавец) Экспорт
	
	ЗагрузитьСписокПоПродавцу(Продавец);
	ЗагрузитьДетализациюПоПрадавцу(Продавец);
	
КонецПроцедуры

Процедура ЗагрузитьСписокПоПродавцу(Продавец) Экспорт
	
	НачалоПериода = ПолучитьНачалоПериодаЗагрузки(Продавец);
	Токен = Справочники.Продавцы.ПолучитьТокен(Продавец);
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Продавец, Тип("СправочникСсылка.Продавцы"));
	
	ДанныеAPI = ОтчетыРеализацииAPI.ПолучитьВсеЕжедневныеОтчетыРеализации(Токен, НачалоПериода);
	
	Если ДанныеAPI = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементAPI Из ДанныеAPI Цикл
		ОбновитьИлиСоздать(ЭлементAPI, Продавец);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьДетализациюПоПрадавцу(Продавец) Экспорт
	
	Токен = Справочники.Продавцы.ПолучитьТокен(Продавец);
	ДокументыБезДетализации = ВыбратьБезЗагруженнойДетализации(Продавец);
	
	Для Каждого Док Из ДокументыБезДетализации Цикл
		
		ДокОбъект = Док.ПолучитьОбъект();		
		ДанныеAPI = ОтчетыРеализацииAPI.ПолучитьВсюДетализациюОтчетаРеализации(Токен, ДокОбъект.ИдОтчета);

		МаппингЗначений.ЗаполнитьТабличнуюЧасть(ДокОбъект.Детализация, ДанныеAPI);
		ДокОбъект.ДетализацияЗагружена = Истина;
		
		ДокОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбновитьИлиСоздать(ДанныеAPI, Продавец)
	
	Объект = Неопределено;
	Ссылка = НайтиПоРеквизиту("ИдОтчета", ДанныеAPI.ИдОтчета);
	
	Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
		Объект = СоздатьДокумент();
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	Объект.Продавец = Продавец;
	ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI);
	
	Объект.Записать();
	Возврат Объект.Ссылка;
	
КонецФункции

Процедура ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI)
	
	Объект.Дата = ДанныеAPI.Дата;
	Объект.ИдОтчета = ДанныеAPI.ИдОтчета;
	Объект.НачалоПериода = ДанныеAPI.НачалоПериода;
	Объект.КонецПериода = ДанныеAPI.КонецПериода;
	Объект.Валюта = Справочники.Валюты.ПолучитьПоНаименованию(ДанныеAPI.Валюта);
	Объект.ВидОтчета = Перечисления.ВидыОтчетаРеализации.Значение(ДанныеAPI.ВидОтчета);
	Объект.СуммаПродаж = ДанныеAPI.СуммаПродаж;
	Объект.СуммаКПеречислению = ДанныеAPI.СуммаКПеречислению;
	Объект.ПроцентСогласованнойСкидки = ДанныеAPI.ПроцентСогласованнойСкидки;
	Объект.СтоимостьЛогистики = ДанныеAPI.СтоимостьЛогистики;
	Объект.СтоимостьХранения = ДанныеAPI.СтоимостьХранения;
	Объект.СтоимостьПриемки = ДанныеAPI.СтоимостьПриемки;
	Объект.СуммаПрочихУдержаний = ДанныеAPI.СуммаПрочихУдержаний;
	Объект.СуммаШтрафов = ДанныеAPI.СуммаШтрафов;
	Объект.СуммаКорректировкиВознаграждения = ДанныеAPI.СуммаКорректировкиВознаграждения;
	Объект.СуммаУдержанияЗаБаллы = ДанныеAPI.СуммаУдержанияЗаБаллы;
	Объект.СуммаКомпенсацииСкидкиЛояльности = ДанныеAPI.СуммаКомпенсацииСкидкиЛояльности;
	Объект.СтоимостьУчастияВЛояльности = ДанныеAPI.СтоимостьУчастияВЛояльности;
	Объект.СтоимостьИзмененияСрокаПеречисления = ДанныеAPI.СтоимостьИзмененияСрокаПеречисления;
	Объект.СуммаКОплате = ДанныеAPI.СуммаКОплате;

КонецПроцедуры

Функция ПолучитьНачалоПериодаЗагрузки(Продавец)
	
	ДатаПоследнегоДокумента = ВыбратьДатуПоследнегоДокумента(Продавец);
	
	Если ДатаПоследнегоДокумента <> Неопределено Тогда
		Возврат ДатаПоследнегоДокумента;
	КонецЕсли;
	
	Возврат Справочники.Продавцы.ПолучитьДатуРегистрации(Продавец);

КонецФункции

Функция ВыбратьДатуПоследнегоДокумента(Продавец)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОтчетРеализации.Дата КАК Дата
	|ИЗ
	|	Документ.ОтчетРеализации КАК ОтчетРеализации
	|ГДЕ
	|	ОтчетРеализации.Продавец = &Продавец
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Продавец", Продавец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Дата;
	
КонецФункции

Функция ВыбратьБезЗагруженнойДетализации(Продавец)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетРеализации.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтчетРеализации КАК ОтчетРеализации
	|ГДЕ
	|	ОтчетРеализации.ДетализацияЗагружена = ЛОЖЬ
	|	И ОтчетРеализации.Продавец = &Продавец
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтчетРеализации.Дата";
	
	Запрос.УстановитьПараметр("Продавец", Продавец);

	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить().ВыгрузитьКолонку(0);
	
КонецФункции

#КонецОбласти

#КонецЕсли
