
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура Загрузить(Продавец, НачалоПериода, КонецПериода) Экспорт
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Продавец, Тип("СправочникСсылка.Продавцы"));
	
	Токен = Справочники.Продавцы.ПолучитьТокен(Продавец);
	ДанныеAPI = ФинансовыеОтчетыAPI.ПолучитьСписокЕжедневныхОтчетовРеализации(Токен, НачалоПериода, КонецПериода);
	
	Если ДанныеAPI = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементAPI Из ДанныеAPI Цикл
		ОбновитьИлиСоздать(ЭлементAPI, Продавец);
	КонецЦикла;
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбновитьИлиСоздать(ДанныеAPI, Продавец)
	
	Объект = Неопределено;
	Ссылка = НайтиПоНомеру(ДанныеAPI.Номер);
	
	Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
		Объект = СоздатьДокумент();
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI, Продавец);
	
	Объект.Записать();
	Возврат Объект.Ссылка;
	
КонецФункции

Процедура ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI, Продавец)
	
	Объект.Номер = ДанныеAPI.Номер;
	Объект.Дата = ДанныеAPI.Дата;
	Объект.Продавец = Продавец;
	Объект.НачалоПериода = ДанныеAPI.НачалоПериода;
	Объект.КонецПериода = ДанныеAPI.КонецПериода;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
