
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьВсе() Экспорт
	
	Продавцы = Справочники.Продавцы.ВыбратьВсехПродавцов();
	
	Для Каждого Продавец Из Продавцы Цикл
		ЗагрузитьПоПродавцу(Продавец);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьПоПродавцу(Продавец) Экспорт
	
	НачалоПериода = ПолучитьНачалоПериодаЗагрузки(Продавец);
	Загрузить(Продавец, НачалоПериода);
	
КонецПроцедуры

Процедура Загрузить(Продавец, НачалоПериода, КонецПериода = Неопределено) Экспорт
	
	Если КонецПериода = Неопределено Тогда
		КонецПериода = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Токен = Справочники.Продавцы.ПолучитьТокен(Продавец);
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Продавец, Тип("СправочникСсылка.Продавцы"));
	
	ДанныеAPI = ФинансовыеОтчетыAPI.ПолучитьСписокЕжедневныхОтчетовРеализации(Токен, НачалоПериода, КонецПериода);
	ДанныеAPI = МаппингЗначений.ПрименитьМаппинг(ДанныеAPI, ПолучитьПараметрыМаппинга());
	
	Если ДанныеAPI = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементAPI Из ДанныеAPI Цикл
		ОбновитьИлиСоздать(ЭлементAPI, Продавец);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ВыбратьДатуПоследнегоДокумента(Продавец) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОтчетРеализации.Дата КАК Дата
	|ИЗ
	|	Документ.ОтчетРеализации КАК ОтчетРеализации
	|ГДЕ
	|	ОтчетРеализации.Продавец = &Продавец
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Продавец", Продавец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Дата;
	
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбновитьИлиСоздать(ДанныеAPI, Продавец)
	
	Объект = Неопределено;
	Ссылка = НайтиПоНомеру(ДанныеAPI.Номер);
	
	Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
		Объект = СоздатьДокумент();
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	Объект.Продавец = Продавец;
	ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI);
	
	Объект.Записать();
	Возврат Объект.Ссылка;
	
КонецФункции

Процедура ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI)
	
	ДанныеAPI.Валюта = Справочники.Валюты.ПолучитьПоНаименованию(ДанныеAPI.Валюта);
	ДанныеAPI.ВидОтчета = Перечисления.ВидыОтчетаРеализации.Значение(ДанныеAPI.ВидОтчета);
	
	МаппингЗначений.ЗаполнитьОбъектИзДанных(Объект, ДанныеAPI);

КонецПроцедуры

Функция ПолучитьПараметрыМаппинга()
	
	ПараметрыМаппинга = Новый Структура;
	// ID отчёта
	ПараметрыМаппинга.Вставить("reportId", Новый Структура("ИмяКлюча, ТипЗначения", "Номер", Тип("Число")));
	// Дата начала отчётного периода
	ПараметрыМаппинга.Вставить("dateFrom", Новый Структура("ИмяКлюча, ТипЗначения", "НачалоПериода", Тип("Дата")));
	// Дата конца отчётного периода
	ПараметрыМаппинга.Вставить("dateTo", Новый Структура("ИмяКлюча, ТипЗначения", "КонецПериода", Тип("Дата")));
	// Дата формирования отчёта
	ПараметрыМаппинга.Вставить("createDate", Новый Структура("ИмяКлюча, ТипЗначения", "Дата", Тип("Дата")));
	// Валюта отчёта
	ПараметрыМаппинга.Вставить("currency", Новый Структура("ИмяКлюча, ТипЗначения", "Валюта", Тип("Строка")));
	// Тип отчёта: 1 - основной, 2 - по выкупам, 3 - по выкупам для Грузии
	ПараметрыМаппинга.Вставить("reportType", Новый Структура("ИмяКлюча, ТипЗначения", "ВидОтчета", Тип("Число")));
	// Продажа
	ПараметрыМаппинга.Вставить("retailAmountSum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаПродаж", Тип("Число")));
	// К перечислению за товар
	ПараметрыМаппинга.Вставить("forPaySum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаКПеречислению", Тип("Число")));
	// Согласованная скидка, %
	ПараметрыМаппинга.Вставить("avgSalePercent", Новый Структура("ИмяКлюча, ТипЗначения", "ПроцентСогласованнойСкидки", Тип("Число")));
	// Стоимость логистики
	ПараметрыМаппинга.Вставить("deliveryServiceSum", Новый Структура("ИмяКлюча, ТипЗначения", "СтоимостьЛогистики", Тип("Число")));
	// Стоимость хранения
	ПараметрыМаппинга.Вставить("paidStorageSum", Новый Структура("ИмяКлюча, ТипЗначения", "СтоимостьХранения", Тип("Число")));
	// Стоимость операций при приёмке
	ПараметрыМаппинга.Вставить("paidAcceptanceSum", Новый Структура("ИмяКлюча, ТипЗначения", "СтоимостьПриемки", Тип("Число")));
	// Прочие удержания и выплаты
	ПараметрыМаппинга.Вставить("deductionSum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаПрочихУдержаний", Тип("Число")));
	// Общая сумма штрафов
	ПараметрыМаппинга.Вставить("penaltySum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаШтрафов", Тип("Число")));
	// Корректировка Вознаграждения Вайлдберриз (ВВ)
	ПараметрыМаппинга.Вставить("additionalPaymentSum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаКорректировкиВознаграждения", Тип("Число")));
	// Сумма, удержанная за начисленные баллы программы лояльности
	ПараметрыМаппинга.Вставить("cashbackAmountSum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаУдержанияЗаБаллы", Тип("Число")));
	// Компенсация скидки по программе лояльности
	ПараметрыМаппинга.Вставить("cashbackDiscountSum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаКомпенсацииСкидкиЛояльности", Тип("Число")));
	// Стоимость участия в программе лояльности
	ПараметрыМаппинга.Вставить("cashbackCommissionChangeSum", Новый Структура("ИмяКлюча, ТипЗначения", "СтоимостьУчастияВЛояльности", Тип("Число")));
	// Разовое изменение срока перечисления денежных средств
	ПараметрыМаппинга.Вставить("paymentSchedule", Новый Структура("ИмяКлюча, ТипЗначения", "СтоимостьИзмененияСрокаПеречисления", Тип("Число")));
	// Итого к оплате
	ПараметрыМаппинга.Вставить("bankPaymentSum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаКОплате", Тип("Число")));
	
	Возврат ПараметрыМаппинга;
	
КонецФункции

Функция ПолучитьНачалоПериодаЗагрузки(Продавец)
	
	ДатаПоследнегоДокумента = ВыбратьДатуПоследнегоДокумента(Продавец);
	
	Если ДатаПоследнегоДокумента <> Неопределено Тогда
		Возврат ДатаПоследнегоДокумента;
	КонецЕсли;
	
	Возврат Справочники.Продавцы.ПолучитьДатуРегистрации(Продавец);

КонецФункции

#КонецОбласти

#КонецЕсли
