
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьВсе() Экспорт
	
	Продавцы = Справочники.Продавцы.ВыбратьВсехПродавцов();
	
	Для Каждого Продавец Из Продавцы Цикл
		ЗагрузитьВсеПоПродавцу(Продавец);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьВсеПоПродавцу(Продавец) Экспорт
	
	ЗагрузитьСписокПоПродавцу(Продавец);
	ЗагрузитьДетализациюПоПрадавцу(Продавец);
	
КонецПроцедуры

Процедура ЗагрузитьСписокПоПродавцу(Продавец) Экспорт
	
	НачалоПериода = ПолучитьНачалоПериодаЗагрузки(Продавец);
	Токен = Справочники.Продавцы.ПолучитьТокен(Продавец);
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Продавец, Тип("СправочникСсылка.Продавцы"));
	
	ДанныеAPI = ОтчетыРеализацииAPI.ПолучитьВсеЕжедневныеОтчетыРеализации(Токен, НачалоПериода);
	
	Если ДанныеAPI = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементAPI Из ДанныеAPI Цикл
		ОбновитьИлиСоздать(ЭлементAPI, Продавец);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьДетализациюПоПрадавцу(Продавец) Экспорт
	
	Токен = Справочники.Продавцы.ПолучитьТокен(Продавец);
	ДокументыБезДетализации = ВыбратьБезЗагруженнойДетализации(Продавец);
	
	Для Каждого Док Из ДокументыБезДетализации Цикл
		
		ДокОбъект = Док.ПолучитьОбъект();		
		ДанныеAPI = ОтчетыРеализацииAPI.ПолучитьВсюДетализациюОтчетаРеализации(Токен, ДокОбъект.ИдОтчета);

		ЗаполнитьДетализациюИзДанныхAPI(ДокОбъект, ДанныеAPI);
		
		ДокОбъект.Записать();
		
		ВызватьПаузу(60000);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПерезаполнитьДетализациюВДокументах(Документы) Экспорт
	
	Если Документы = Неопределено Тогда
		Возврат
	КонецЕсли;

	Для Каждого Документ Из Документы Цикл
		
		ДокументОбъект = Документ.ПолучитьОбъект();
		
		Если ДокументОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Стр Из ДокументОбъект.Детализация Цикл
			ЗаполнитьСтрокуДетализации(Стр, ДокументОбъект);
		КонецЦикла;
		
		ДокументОбъект.Записать();
		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбновитьИлиСоздать(ДанныеAPI, Продавец)
	
	Объект = Неопределено;
	Ссылка = НайтиПоРеквизиту("ИдОтчета", ДанныеAPI.ИдОтчета);
	
	Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
		Объект = СоздатьДокумент();
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	Объект.Продавец = Продавец;
	ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI);
	
	Объект.Записать();
	Возврат Объект.Ссылка;
	
КонецФункции

Процедура ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI)
	
	Объект.Дата = ДанныеAPI.Дата;
	Объект.ИдОтчета = ДанныеAPI.ИдОтчета;
	Объект.НачалоПериода = ДанныеAPI.НачалоПериода;
	Объект.КонецПериода = ДанныеAPI.КонецПериода;
	Объект.Валюта = Справочники.Валюты.ПолучитьПоНаименованию(ДанныеAPI.Валюта);
	Объект.ВидОтчета = Перечисления.ВидыОтчетаРеализации.Значение(ДанныеAPI.ВидОтчета);
	Объект.СуммаПродаж = ДанныеAPI.СуммаПродаж;
	Объект.СуммаКПеречислению = ДанныеAPI.СуммаКПеречислению;
	Объект.ПроцентСогласованнойСкидки = ДанныеAPI.ПроцентСогласованнойСкидки;
	Объект.СтоимостьЛогистики = ДанныеAPI.СтоимостьЛогистики;
	Объект.СтоимостьХранения = ДанныеAPI.СтоимостьХранения;
	Объект.СтоимостьПриемки = ДанныеAPI.СтоимостьПриемки;
	Объект.СуммаПрочихУдержаний = ДанныеAPI.СуммаПрочихУдержаний;
	Объект.СуммаШтрафов = ДанныеAPI.СуммаШтрафов;
	Объект.СуммаКорректировкиВознаграждения = ДанныеAPI.СуммаКорректировкиВознаграждения;
	Объект.СуммаУдержанияЗаБаллы = ДанныеAPI.СуммаУдержанияЗаБаллы;
	Объект.СуммаКомпенсацииСкидкиЛояльности = ДанныеAPI.СуммаКомпенсацииСкидкиЛояльности;
	Объект.СтоимостьУчастияВЛояльности = ДанныеAPI.СтоимостьУчастияВЛояльности;
	Объект.СтоимостьИзмененияСрокаПеречисления = ДанныеAPI.СтоимостьИзмененияСрокаПеречисления;
	Объект.СуммаКОплате = ДанныеAPI.СуммаКОплате;

КонецПроцедуры

Процедура ЗаполнитьДетализациюИзДанныхAPI(Объект, ДанныеAPI)
	
	Объект.Детализация.Очистить();
	
	Для Каждого СтрAPI Из ДанныеAPI Цикл
		
		СтрДетализация = Объект.Детализация.Добавить();
		
		СтрAPI.Свойство("АртикулWB", СтрДетализация.АртикулWB);
		СтрAPI.Свойство("БанкЭквайер", СтрДетализация.БанкЭквайер);
		СтрAPI.Свойство("КоличествоДоставок", СтрДетализация.КоличествоДоставок);
		СтрAPI.Свойство("ВидыЛогистикиШтрафов", СтрДетализация.ВидыЛогистикиШтрафов);
		СтрAPI.Свойство("ДатаВремяЗаказа", СтрДетализация.ДатаВремяЗаказа);
		СтрAPI.Свойство("ДатаВремяПродажи", СтрДетализация.ДатаВремяПродажи);
		СтрAPI.Свойство("ДатаОперации", СтрДетализация.ДатаОперации);
		СтрAPI.Свойство("ИдАкцииПродавца", СтрДетализация.ИдАкцииПродавца);
		СтрAPI.Свойство("ИдЗаказа", СтрДетализация.ИдЗаказа);
		СтрAPI.Свойство("ИдКорзиныЗаказа", СтрДетализация.ИдКорзиныЗаказа);
		СтрAPI.Свойство("ИдКороба", СтрДетализация.ИдКороба);
		СтрAPI.Свойство("ИдОфисаДоставки", СтрДетализация.ИдОфисаДоставки);
		СтрAPI.Свойство("ИдПодменногоАртикула", СтрДетализация.ИдПодменногоАртикула);
		СтрAPI.Свойство("ИдПоставки", СтрДетализация.ИдПоставки);
		СтрAPI.Свойство("ИдПромокода", СтрДетализация.ИдПромокода);
		СтрAPI.Свойство("ИдРазмера", СтрДетализация.ИдРазмера);
		СтрAPI.Свойство("ИдСборочногоЗадания", СтрДетализация.ИдСборочногоЗадания);
		СтрAPI.Свойство("ИдСкидкиЛояльности", СтрДетализация.ИдСкидкиЛояльности);
		СтрAPI.Свойство("ИдСтроки", СтрДетализация.ИдСтроки);
		СтрAPI.Свойство("ИННПартнера", СтрДетализация.ИННПартнера);
//		СтрAPI.Свойство("КодМаркировки", СтрДетализация.КодМаркировки);
		СтрAPI.Свойство("Количество", СтрДетализация.Количество);
		СтрAPI.Свойство("КоличествоВозврата", СтрДетализация.КоличествоВозврата);
		СтрAPI.Свойство("КонецДействияФиксации", СтрДетализация.КонецДействияФиксации);
		СтрAPI.Свойство("НаименованиеСклада", СтрДетализация.НаименованиеСклада);
		СтрAPI.Свойство("НачалоДействияФиксации", СтрДетализация.НачалоДействияФиксации);
		СтрAPI.Свойство("НомерТаможеннойДекларации", СтрДетализация.НомерТаможеннойДекларации);
		СтрAPI.Свойство("ОбоснованиеДляОплаты", СтрДетализация.ОбоснованиеДляОплаты);
		СтрAPI.Свойство("ОрганизаторПеревозки", СтрДетализация.ОрганизаторПеревозки);
		СтрAPI.Свойство("ОфисДоставки", СтрДетализация.ОфисДоставки);
		СтрAPI.Свойство("Партнер", СтрДетализация.Партнер);
		СтрAPI.Свойство("ПризнакB2BПродажи", СтрДетализация.ПризнакB2BПродажи);
		СтрAPI.Свойство("ПризнакПлатнойДоставки", СтрДетализация.ПризнакПлатнойДоставки);
		СтрAPI.Свойство("ПроцентАгентскогоНДС", СтрДетализация.ПроцентАгентскогоНДС);
		СтрAPI.Свойство("ПроцентДополнительнойСкидкиАкции", СтрДетализация.ПроцентДополнительнойСкидкиАкции);
		СтрAPI.Свойство("ПроцентИтоговойСогласованнойСкидки", СтрДетализация.ПроцентИтоговойСогласованнойСкидки);
		СтрAPI.Свойство("ПроцентИтоговыйКВВ", СтрДетализация.ПроцентИтоговыйКВВ);
		СтрAPI.Свойство("ПроцентКВВ", СтрДетализация.ПроцентКВВ);
		СтрAPI.Свойство("ПроцентКВВБазовый", СтрДетализация.ПроцентКВВБазовый);
		СтрAPI.Свойство("ПроцентКомпенсацииПлатежныхУслуг", СтрДетализация.ПроцентКомпенсацииПлатежныхУслуг);
		СтрAPI.Свойство("ПроцентОптовойСкидкиДляБизнеса", СтрДетализация.ПроцентОптовойСкидкиДляБизнеса);
		СтрAPI.Свойство("ПроцентПлатформеннойСкидки", СтрДетализация.ПроцентПлатформеннойСкидки);
		СтрAPI.Свойство("ПроцентПродуктовогоДисконта", СтрДетализация.ПроцентПродуктовогоДисконта);
		СтрAPI.Свойство("ПроцентПромокода", СтрДетализация.ПроцентПромокода);
		СтрAPI.Свойство("ПроцентСкидкиWibes", СтрДетализация.ПроцентСкидкиWibes);
		СтрAPI.Свойство("ПроцентСкидкиЗаПромокод", СтрДетализация.ПроцентСкидкиЗаПромокод);
		СтрAPI.Свойство("ПроцентСкидкиЛояльности", СтрДетализация.ПроцентСкидкиЛояльности);
		СтрAPI.Свойство("ПроцентСкидкиПодменногоАртикула", СтрДетализация.ПроцентСкидкиПодменногоАртикула);
		СтрAPI.Свойство("ПроцентСниженияКВВЗаАкцию", СтрДетализация.ПроцентСниженияКВВЗаАкцию);
		СтрAPI.Свойство("ПроцентСниженияКВВЗаРейтинг", СтрДетализация.ПроцентСниженияКВВЗаРейтинг);
		СтрAPI.Свойство("СпособПродажи", СтрДетализация.СпособПродажи);
		СтрAPI.Свойство("СтикерМП", СтрДетализация.СтикерМП);
		
		СтранаПродажи = Неопределено;
		Если СтрAPI.Свойство("СтранаПродажи", СтранаПродажи) Тогда
			СтрДетализация.СтранаПродажи = Справочники.Страны.ПолучитьПоНаименованию(СтранаПродажи);
		КонецЕсли;
		
		СтрAPI.Свойство("СуммаВозмещенияИздержек", СтрДетализация.СуммаВозмещенияИздержек);
		СтрAPI.Свойство("СуммаВозмещенияПВЗ", СтрДетализация.СуммаВозмещенияПВЗ);
		СтрAPI.Свойство("СуммаВознагражденияWB", СтрДетализация.СуммаВознагражденияWB);
		СтрAPI.Свойство("СуммаВознагражденияСПродаж", СтрДетализация.СуммаВознагражденияСПродаж);
		СтрAPI.Свойство("СуммаИзмененияСрокаПеречисления", СтрДетализация.СуммаИзмененияСрокаПеречисления);
		СтрAPI.Свойство("СуммаКомпенсацииПлатежныхУслуг", СтрДетализация.СуммаКомпенсацииПлатежныхУслуг);
		СтрAPI.Свойство("СуммаКомпенсацииСкидкиЛояльности", СтрДетализация.СуммаКомпенсацииСкидкиЛояльности);
		СтрAPI.Свойство("СуммаКорректировкиВознагражденияWB", СтрДетализация.СуммаКорректировкиВознагражденияWB);
		СтрAPI.Свойство("СуммаКПеречислениюПродавцу", СтрДетализация.СуммаКПеречислениюПродавцу);
		СтрAPI.Свойство("СуммаНДСВознагражденияWB", СтрДетализация.СуммаНДСВознагражденияWB);
		СтрAPI.Свойство("СуммаПриемки", СтрДетализация.СуммаПриемки);
		СтрAPI.Свойство("СуммаСкидкиСофинансирования", СтрДетализация.СуммаСкидкиСофинансирования);
		СтрAPI.Свойство("СуммаУдержаний", СтрДетализация.СуммаУдержаний);
		СтрAPI.Свойство("СуммаУдержанияЗаБаллы", СтрДетализация.СуммаУдержанияЗаБаллы);
		СтрAPI.Свойство("СуммаУчастияВЛояльности", СтрДетализация.СуммаУчастияВЛояльности);
		СтрAPI.Свойство("СуммаХранения", СтрДетализация.СуммаХранения);
		СтрAPI.Свойство("СуммаШтрафов", СтрДетализация.СуммаШтрафов);
		СтрAPI.Свойство("ТипКоробов", СтрДетализация.ТипКоробов);
		СтрAPI.Свойство("ТипПлатежныхУслуг", СтрДетализация.ТипПлатежныхУслуг);
		СтрAPI.Свойство("СуммаДоставки", СтрДетализация.СуммаДоставки);
		СтрAPI.Свойство("ФиксированныйКоэффициентСклада", СтрДетализация.ФиксированныйКоэффициентСклада);
		СтрAPI.Свойство("ЦенаРеализацииWB", СтрДетализация.ЦенаРеализацииWB);
		СтрAPI.Свойство("ЦенаРозничная", СтрДетализация.ЦенаРозничная);
		СтрAPI.Свойство("ЦенаРозничнаяСоСкидкой", СтрДетализация.ЦенаРозничнаяСоСкидкой);
		СтрAPI.Свойство("Штрихкод", СтрДетализация.Штрихкод);
		
		ЗаполнитьСтрокуДетализации(СтрДетализация, Объект);
		
	КонецЦикла;
	
	Объект.ДетализацияЗагружена = Истина;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуДетализации(Стр, Объект)
	
	Стр.ГруппаСтатьи = Справочники.СтатьиWB.ПолучитьГруппуПоНаименование(Стр.ОбоснованиеДляОплаты);
	Стр.Статья = Справочники.СтатьиWB.ПолучитьЭлементПоНаименование(Стр.ВидыЛогистикиШтрафов, Стр.ГруппаСтатьи);
	
	Если ЗначениеЗаполнено(Стр.АртикулWB) Тогда
		Стр.КарточкаТовара = Справочники.КарточкиТоваров.НайтиПоРеквизиту("АртикулWB", Стр.АртикулWB, , Объект.Продавец);
	Иначе
		Стр.КарточкаТовара = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Стр.КарточкаТовара) И ЗначениеЗаполнено(Стр.ИдРазмера) Тогда
		Стр.Размер = Справочники.РазмерыКарточекТоваров.НайтиПоРеквизиту("Размер", Стр.ИдРазмера, , Стр.КарточкаТовара);
	Иначе
		Стр.Размер = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Стр.НаименованиеСклада) Тогда
		Стр.Склад = Справочники.СкладыWB.НайтиПоНаименованию(Стр.НаименованиеСклада, Истина);
	Иначе
		Стр.Склад = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Стр.ИдПоставки) Тогда
		Стр.Поставка = Документы.Поставки.НайтиПоИдПоставки(Стр.ИдПоставки);
	Иначе
		Стр.Поставка = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Стр.ИдЗаказа) Тогда
		Стр.Заказ = Документы.ЗаказыПокупателей.ПолучитьПоДетализацииОтчетаРеализации(Стр, Объект.Ссылка, Объект.Продавец);
	Иначе
		Стр.Заказ = Неопределено;
	КонецЕсли;
	
	Если Стр.ПроцентКВВ > 0 Тогда
		Стр.СуммаКВВ = Стр.ЦенаРозничнаяСоСкидкой * Стр.ПроцентКВВ / 100;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьНачалоПериодаЗагрузки(Продавец)
	
	ДатаПоследнегоДокумента = ВыбратьДатуПоследнегоДокумента(Продавец);
	
	Если ДатаПоследнегоДокумента <> Неопределено Тогда
		Возврат ДатаПоследнегоДокумента;
	КонецЕсли;
	
	Возврат Справочники.Продавцы.ПолучитьДатуРегистрации(Продавец);

КонецФункции

Функция ВыбратьДатуПоследнегоДокумента(Продавец)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОтчетРеализации.Дата КАК Дата
	|ИЗ
	|	Документ.ОтчетРеализации КАК ОтчетРеализации
	|ГДЕ
	|	ОтчетРеализации.Продавец = &Продавец
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Продавец", Продавец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Дата;
	
КонецФункции

Функция ВыбратьБезЗагруженнойДетализации(Продавец)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетРеализации.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтчетРеализации КАК ОтчетРеализации
	|ГДЕ
	|	ОтчетРеализации.ДетализацияЗагружена = ЛОЖЬ
	|	И ОтчетРеализации.Продавец = &Продавец
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтчетРеализации.Дата";
	
	Запрос.УстановитьПараметр("Продавец", Продавец);

	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить().ВыгрузитьКолонку(0);
	
КонецФункции

#КонецОбласти

#КонецЕсли
