
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр СебестоимостьПартий
	Движения.СебестоимостьПартий.Записывать = Истина;
	Для Каждого ТекСтрокаДетализация из Детализация Цикл
		Движение = Движения.СебестоимостьПартий.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Продавец = Продавец;
		Движение.Поставка = ТекСтрокаДетализация.Поставка;
		Движение.КарточкаТовара = ТекСтрокаДетализация.КарточкаТовара;
		Движение.Размер = ТекСтрокаДетализация.Размер;
		Движение.Количество = ТекСтрокаДетализация.Количество;
	КонецЦикла;

КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДвиженияПоСреднескользящейОценке()
	
	
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
