#Область ПрограммныйИнтерфейс

Функция ВыполнитьЗапрос(Токен, АдресСервера, ВидЗапроса, Путь, ПараметрыURL = Неопределено, ПараметрыJSON = Неопределено,
	ПараметрыМаппинга = Неопределено) Экспорт
	
	// Проверка входных параметров
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(АдресСервера, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(ВидЗапроса, Тип("ПеречислениеСсылка.ВидHTTPЗапроса"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Путь, Тип("Строка"));

	Таймаут = 30;

	Если ПараметрыURL <> Неопределено Тогда
		Путь = Путь + "?" + СтруктураВПараметрыURL(ПараметрыURL);
	КонецЕсли;

	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
	Соединение = Новый HTTPСоединение(АдресСервера, , , , , Таймаут, ЗащищенноеСоединение);
	Запрос = Новый HTTPЗапрос(Путь);
	Запрос.Заголовки.Вставить("Authorization", Токен);
	Запрос.Заголовки.Вставить("Content-Type", "application/json");
	Запрос.Заголовки.Вставить("Accept", "application/json");

	Если ПараметрыJSON <> Неопределено Тогда
		СтрокаJSON = ПарсерJSON.ПолучитьJSON(ПараметрыJSON);
		Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
	КонецЕсли;

	Ответ = Неопределено;

	Попытка
		Если ВидЗапроса = Перечисления.ВидHTTPЗапроса.GET Тогда
			Ответ = Соединение.Получить(Запрос);
		ИначеЕсли ВидЗапроса = Перечисления.ВидHTTPЗапроса.POST Тогда
			Ответ = Соединение.ОтправитьДляОбработки(Запрос);
		ИначеЕсли ВидЗапроса = Перечисления.ВидHTTPЗапроса.PATCH Тогда
			Ответ = Соединение.Изменить(Запрос);
		ИначеЕсли ВидЗапроса = Перечисления.ВидHTTPЗапроса.DELETE Тогда
			Ответ = Соединение.Удалить(Запрос);
		Иначе
			ВызватьИсключение("Неподдерживаемый вид HTTP-запроса", КатегорияОшибки.ОшибкаКонфигурации);
		КонецЕсли;
	Исключение
		ВызватьИсключение
	КонецПопытки;
	
	Если Ответ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КодСостояния = Ответ.КодСостояния;

	Если КодСостояния = 200 Тогда
		Возврат ПарсерJSON.ПолучитьЗначение(Ответ.ПолучитьТелоКакСтроку(), ПараметрыМаппинга);
	ИначеЕсли КодСостояния = 204 Тогда
		Возврат Неопределено
	Иначе
		ОбработатьОшибку(Ответ);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СерверОбщий() Экспорт
	Возврат "common-api.wildberries.ru";
КонецФункции

Функция СерверКонтента() Экспорт
	Возврат "content-api.wildberries.ru";
КонецФункции

Функция СерверАналитики() Экспорт
	Возврат "seller-analytics-api.wildberries.ru";
КонецФункции

Функция СерверЦенИСкидок() Экспорт
	Возврат "discounts-prices-api.wildberries.ru";
КонецФункции

Функция СерверМаркетплейса() Экспорт
	Возврат "marketplace-api.wildberries.ru";
КонецФункции

Функция СерверСтатистики() Экспорт
	Возврат "statistics-api.wildberries.ru";
КонецФункции

Функция СерверПродвижения() Экспорт
	Возврат "advert-api.wildberries.ru";
КонецФункции

Функция СерверВопросовИОтзывов() Экспорт
	Возврат "feedbacks-api.wildberries.ru";
КонецФункции

Функция СерверЧатаСПокупателями() Экспорт
	Возврат "buyer-chat-api.wildberries.ru";
КонецФункции

Функция СерверПоставок() Экспорт
	Возврат "supplies-api.wildberries.ru";
КонецФункции

Функция СерверВозвратовПокупателями() Экспорт
	Возврат "returns-api.wildberries.ru";
КонецФункции

Функция СерверДокументов() Экспорт
	Возврат "documents-api.wildberries.ru";
КонецФункции

Функция СерверФинансов() Экспорт
	Возврат "finance-api.wildberries.ru";
КонецФункции

Функция СерверПользователей() Экспорт
	Возврат "user-management-api.wildberries.ru";
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьОшибку(Ответ)
	
	Если Ответ = Неопределено Тогда
        Возврат
	КонецЕсли;
	
	КодОшибки = Ответ.КодСостояния;
	ТелоОшибки = Ответ.ПолучитьТелоКакСтроку();
	
	ОписаниеОшибки = Неопределено;
	
	Если КодОшибки >= 500 И КодОшибки < 600 Тогда
		ОписаниеОшибки = "Внутренняя ошибка сервера." + Символы.ПС
			+ "Сервис недоступен. Повторите запрос позже или обратитесь в техническую поддержку";
	Иначе
		СоответствиеОшибок = Новый Соответствие;
		СоответствиеОшибок.Вставить(208, "Такая загрузка уже есть.");
		СоответствиеОшибок.Вставить(400, "Неправильный запрос." + Символы.ПС 
			+ "Проверьте синтаксис запроса");
		СоответствиеОшибок.Вставить(401, "Пользователь не авторизован." + Символы.ПС 
			+ "Проверьте токен авторизации.
			|Категория токена должна совпадать с категорией API. Также токен может:" + Символы.ПС 
			+ "• быть просрочен" + Символы.ПС 
			+ "• быть некорректным" + Символы.ПС
			+ "• отсутствовать в запросе");
		СоответствиеОшибок.Вставить(402, "Требуется платёж." + Символы.ПС
			+ "Ошибка означает, что на балансе сервиса из Каталога недостаточно средств");
		СоответствиеОшибок.Вставить(403, "Доступ запрещён." + Символы.ПС 
			+ "Токен не должен быть сгенерирован удалённым пользователем.
			| Доступ к методу не должен быть заблокирован.
			| Если вы хотите использовать методы Джема, проверьте подписку в личном кабинете");
		СоответствиеОшибок.Вставить(404, "Не найдено." + Символы.ПС 
			+ "Проверьте URL запроса");
		СоответствиеОшибок.Вставить(409, "Ошибка сохранения для части ссылок/обновления
			| статуса/добавления сборочного задания/т.д." + Символы.ПС
			+ "Проверьте данные запроса. Они должны отвечать требованиям и ограничениям сервиса");
		СоответствиеОшибок.Вставить(413, "Превышен лимит объёма данных в запросе." + Символы.ПС
			+ "Уменьшите количество объектов в запросе");
		СоответствиеОшибок.Вставить(422, "Отсутствие в запросе параметра nmId/Размер ставки не изменен/т.д." + Символы.ПС
			+ "Проверьте данные запроса. Данные запроса не должны противоречить друг другу");
		СоответствиеОшибок.Вставить(429, "Слишком много запросов." + Символы.ПС
			+ "Проверьте лимиты запросов и повторите запрос позже");
	
		ОписаниеОшибки = СоответствиеОшибок.Получить(КодОшибки);
	КонецЕсли;

	Если ОписаниеОшибки = Неопределено Тогда
		ВызватьИсключение("Не известная ошибка." + Символы.ПС + "Код ошибки: " + КодОшибки,  
			КатегорияОшибки.ОшибкаКонфигурации, КодОшибки, ТелоОшибки);
	Иначе
		ВызватьИсключение(ОписаниеОшибки, , КодОшибки, ТелоОшибки)
	КонецЕсли;

КонецПроцедуры

Функция СтруктураВПараметрыURL(Структура)

	Результат = "";

	Для Каждого КлючЗначение Из Структура Цикл

		Если Результат <> "" Тогда
			Результат = Результат + "&";
		КонецЕсли;

		Значение = Строка(КлючЗначение.Значение);
		Результат = Результат + КлючЗначение.Ключ + "=" + Значение;
	КонецЦикла;

	Возврат Результат;
КонецФункции

#КонецОбласти