
#Область ПрограммныйИнтерфейс

Функция ПолучитьВсеЗаказы(Токен, НачалоПериода) Экспорт
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(НачалоПериода, Тип("Дата"));
	
	Результат = Новый Массив;
	
	Пока Истина Цикл
		
		ДанныеAPI = ПолучитьЗаказы(Токен, НачалоПериода);
		
		Если ДанныеAPI = Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		
		Количество = ДанныеAPI.Количество();
		
		Если Количество = 0 Тогда
			Возврат Результат;
		КонецЕсли;

		Для Каждого ЭлементAPI Из ДанныеAPI Цикл
			Результат.Добавить(ЭлементAPI);
		КонецЦикла;
		
		ПоследнийЭлементAPI = ДанныеAPI.Получить(Количество - 1);
		НачалоПериода = ПоследнийЭлементAPI.ДатаОбновления;
		
	КонецЦикла;
	
	Возврат Результат
	
КонецФункции

Функция ПолучитьЗаказы(Токен, НачалоПериода) Экспорт
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(НачалоПериода, Тип("Дата"));
	
	АдресСервера = КлиентAPI.СерверСтатистики();
	Путь = "/api/v1/supplier/orders";
	
	ПараметрыЗапросаURL = Новый Структура;
	ПараметрыЗапросаURL.Вставить("dateFrom", Формат(НачалоПериода, "ДФ=yyyy-MM-ddTHH:mm:ss;"));
	
	ДанныеAPI = КлиентAPI.ВыполнитьЗапрос(Токен, АдресСервера, Перечисления.ТипыHTTPЗапроса.GET, Путь, ПараметрыЗапросаURL);
	Возврат МаппингЗначений.ПрименитьМаппинг(ДанныеAPI, ПолучитьПараметрыМаппингаЗаказа());;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПараметрыМаппингаЗаказа()

	ПараметрыМаппинга = Новый Структура;
	
	// Дата и время заказа. Это поле соответствует параметру dateFrom в запросе, если параметр flag=1.
	// Если часовой пояс не указан, то берётся Московское время (UTC+3)
	ПараметрыМаппинга.Вставить("date", Новый Структура("ИмяКлюча, ТипЗначения", "Дата", Тип("Дата")));
	// Дата и время обновления информации в сервисе.
	// Это поле соответствует параметру dateFrom в запросе, если параметр flag=0 или не указан.
	// Если часовой пояс не указан, то берётся Московское время (UTC+3)
	ПараметрыМаппинга.Вставить("lastChangeDate", Новый Структура("ИмяКлюча, ТипЗначения", "ДатаОбновления", Тип("Дата")));
	// Склад отгрузки
	ПараметрыМаппинга.Вставить("warehouseName", Новый Структура("ИмяКлюча, ТипЗначения", "СкладОтгрузки", Тип("Строка")));
	// Тип склада хранения товаров ("Склад WB" или "Склад продавца")
	ПараметрыМаппинга.Вставить("warehouseType", Новый Структура("ИмяКлюча, ТипЗначения", "ТипСклада", Тип("Строка")));
	// Страна
	ПараметрыМаппинга.Вставить("countryName", Новый Структура("ИмяКлюча, ТипЗначения", "Страна", Тип("Строка")));
	// Округ
	ПараметрыМаппинга.Вставить("oblastOkrugName", Новый Структура("ИмяКлюча, ТипЗначения", "Округ", Тип("Строка")));
	// Регион
	ПараметрыМаппинга.Вставить("regionName", Новый Структура("ИмяКлюча, ТипЗначения", "Регион", Тип("Строка")));
	// Артикул продавца
	ПараметрыМаппинга.Вставить("supplierArticle", Новый Структура("ИмяКлюча, ТипЗначения", "АртикулПродавца", Тип("Строка")));
	// Артикул WB
	ПараметрыМаппинга.Вставить("nmId", Новый Структура("ИмяКлюча, ТипЗначения", "АртикулWB", Тип("Число")));
	// Баркод
	ПараметрыМаппинга.Вставить("barcode", Новый Структура("ИмяКлюча, ТипЗначения", "Баркод", Тип("Строка")));
	// Категория
	ПараметрыМаппинга.Вставить("category", Новый Структура("ИмяКлюча, ТипЗначения", "Категория", Тип("Строка")));
	// Предмет
	ПараметрыМаппинга.Вставить("subject", Новый Структура("ИмяКлюча, ТипЗначения", "Предмет", Тип("Строка")));
	// Бренд
	ПараметрыМаппинга.Вставить("brand", Новый Структура("ИмяКлюча, ТипЗначения", "Бренд", Тип("Строка")));
	// Размер товара
	ПараметрыМаппинга.Вставить("techSize", Новый Структура("ИмяКлюча, ТипЗначения", "Размер", Тип("Строка")));
	// Номер поставки
	ПараметрыМаппинга.Вставить("incomeID", Новый Структура("ИмяКлюча, ТипЗначения", "ИдПоставки", Тип("Число")));
	// Договор поставки
	ПараметрыМаппинга.Вставить("isSupply", Новый Структура("ИмяКлюча, ТипЗначения", "ЭтоДоговорПоставки", Тип("Булево")));
	// Договор реализации
	ПараметрыМаппинга.Вставить("isRealization", Новый Структура("ИмяКлюча, ТипЗначения", "ЭтоДоговорРеализации", Тип("Булево")));
	// Цена без скидок
	ПараметрыМаппинга.Вставить("totalPrice", Новый Структура("ИмяКлюча, ТипЗначения", "ЦенаБезСкидок", Тип("Число")));
	// Скидка продавца, %
	ПараметрыМаппинга.Вставить("discountPercent", Новый Структура("ИмяКлюча, ТипЗначения", "СкидкаПродавцаПроцент", Тип("Число")));
	// Скидка WB, %
	ПараметрыМаппинга.Вставить("spp", Новый Структура("ИмяКлюча, ТипЗначения", "СкидкаWBПроцент", Тип("Число")));
	// Цена с учетом всех скидок, кроме суммы по WB Кошельку
	ПараметрыМаппинга.Вставить("finishedPrice", Новый Структура("ИмяКлюча, ТипЗначения", "ЦенаСоСкидками", Тип("Число")));
	// Цена со скидкой продавца, в том числе со скидкой WB Клуба
	ПараметрыМаппинга.Вставить("priceWithDisc", Новый Структура("ИмяКлюча, ТипЗначения", "ЦенаСоСкидкойПродавца", Тип("Число")));
	// Отмена заказа: true - заказ отменен
	ПараметрыМаппинга.Вставить("isCancel", Новый Структура("ИмяКлюча, ТипЗначения", "Отменен", Тип("Булево")));
	// Дата и время отмены заказа. Если заказ не был отменен, то "0001-01-01T00:00:00".
	// Если часовой пояс не указан, то берётся Московское время UTC+3
	ПараметрыМаппинга.Вставить("cancelDate", Новый Структура("ИмяКлюча, ТипЗначения", "ДатаОтмены", Тип("Дата")));
	// ID стикера
	ПараметрыМаппинга.Вставить("sticker", Новый Структура("ИмяКлюча, ТипЗначения", "ИДСтикера", Тип("Строка")));
	// ID корзины покупателя. Заказы одной транзакции будут иметь одинаковый gNumber
	ПараметрыМаппинга.Вставить("gNumber", Новый Структура("ИмяКлюча, ТипЗначения", "ИДКорзиныПокупателя", Тип("Строка")));
	// Уникальный ID заказа. Примечание для использующих API Маркетплейс: srid равен rid в ответах методов сборочных заданий
	ПараметрыМаппинга.Вставить("srid", Новый Структура("ИмяКлюча, ТипЗначения", "ИДЗаказа", Тип("Строка")));

	Возврат ПараметрыМаппинга;

КонецФункции


#КонецОбласти
