#Область ПрограммныйИнтерфейс

Функция ПолучитьИнформациюОПродавце(Токен) Экспорт
	
	// Проверка входных параметров
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	
	АдресСервера = КлиентAPI.СерверОбщий();
	Путь = "/api/v1/seller-info";
	
	ДанныеAPI = КлиентAPI.ВыполнитьЗапрос(Токен, АдресСервера, Перечисления.ТипыHTTPЗапроса.GET, Путь);
	Возврат МаппингЗначений.ПрименитьМаппинг(ДанныеAPI, ПолучитьПараметрыМаппингаИнформациюОПродавце());
	
КонецФункции

Функция ПолучитьРейтингПродавца(Токен) Экспорт
	
	// Проверка входных параметров
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	
	Сервер = КлиентAPI.СерверВопросовИОтзывов();
	Путь = "/api/common/v1/rating";
	
	ДанныеAPI = КлиентAPI.ВыполнитьЗапрос(Токен, Сервер, Перечисления.ТипыHTTPЗапроса.GET, Путь);
	Возврат МаппингЗначений.ПрименитьМаппинг(ДанныеAPI, ПолучитьПараметрыМаппингаРейтингПродавца());
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПараметрыМаппингаРейтингПродавца()
	
	ПараметрыМаппинга = Новый Структура;
	ПараметрыМаппинга.Вставить("feedbackCount", "КоличествоОтзывов");
	ПараметрыМаппинга.Вставить("valuation", "РейтингПродавца");
	
	Возврат ПараметрыМаппинга;
	
КонецФункции

Функция ПолучитьПараметрыМаппингаИнформациюОПродавце()
	
	ПараметрыМаппинга = Новый Структура;
	ПараметрыМаппинга.Вставить("name", Новый Структура("ИмяКлюча, ТипЗначения", "Наименование", Тип("Строка")));
	ПараметрыМаппинга.Вставить("sid", Новый Структура("ИмяКлюча, ТипЗначения", "Ууид", Тип("Строка")));
	ПараметрыМаппинга.Вставить("tin", Новый Структура("ИмяКлюча, ТипЗначения", "ИНН", Тип("Число")));
	ПараметрыМаппинга.Вставить("tradeMark", Новый Структура("ИмяКлюча, ТипЗначения", "НазваниеМагазина", Тип("Строка")));
	
	Возврат ПараметрыМаппинга;
	
КонецФункции

#КонецОбласти
