#Область ПрограммныйИнтерфейс

Функция ПолучитьИнформациюОПродавце(Токен) Экспорт
	
	// Проверка входных параметров
	Если Не ЗначениеЗаполнено(Токен) Тогда
		ВызватьИсключение("Не заполнен обязательный параметр токен", КатегорияОшибки.ОшибкаКонфигурации);
	КонецЕсли;
	
	Сервер = КлиентAPI.СерверОбщий();
	Путь = "/api/v1/seller-info";
	
	Возврат КлиентAPI.ВыполнитьЗапрос(Токен, Сервер, Перечисления.ВидHTTPЗапроса.GET, Путь, , , ПолчитьСоответствиеКлючей())
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолчитьСоответствиеКлючей()
	
	СоответствиеКлючей = Новый Структура;
	СоответствиеКлючей.Вставить("name", "Наименование");
	СоответствиеКлючей.Вставить("sid", "Ууид");
	СоответствиеКлючей.Вставить("tin", "ИНН");
	СоответствиеКлючей.Вставить("tradeMark", "НазваниеМагазина");
	
	Возврат СоответствиеКлючей
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
