#Область ПрограммныйИнтерфейс

Функция ПолучитьИнформациюОПродавце(Токен) Экспорт
	
	// Проверка входных параметров
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	
	АдресСервера = КлиентAPI.СерверОбщий();
	Путь = "/api/v1/seller-info";
	
	Возврат КлиентAPI.ВыполнитьЗапрос(Токен, АдресСервера, Перечисления.ВидHTTPЗапроса.GET, Путь);
	
КонецФункции

Функция ПолучитьРейтингПродавца(Токен) Экспорт
	
	// Проверка входных параметров
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	
	Сервер = КлиентAPI.СерверВопросовИОтзывов();
	Путь = "/api/common/v1/rating";
	
	Возврат КлиентAPI.ВыполнитьЗапрос(Токен, Сервер, Перечисления.ВидHTTPЗапроса.GET, Путь)
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
