#Область ПрограммныйИнтерфейс

Функция ПолучитьИнформациюОПродавце(Токен) Экспорт
	
	// Проверка входных параметров
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	
	АдресСервера = КлиентAPI.СерверОбщий();
	Путь = "/api/v1/seller-info";
	
	СоответствиеКлючей = Новый Структура;
	СоответствиеКлючей.Вставить("name", "Наименование");
	СоответствиеКлючей.Вставить("sid", "Ууид");
	СоответствиеКлючей.Вставить("tin", "ИНН");
	СоответствиеКлючей.Вставить("tradeMark", "НазваниеМагазина");
	
	Возврат КлиентAPI.ВыполнитьЗапрос(Токен, АдресСервера, Перечисления.ВидHTTPЗапроса.GET, Путь, , , СоответствиеКлючей)
	
КонецФункции

Функция ПолучитьРейтингПродавца(Токен) Экспорт
	
	// Проверка входных параметров
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	
	Сервер = КлиентAPI.СерверВопросовИОтзывов();
	Путь = "/api/common/v1/rating";
	
	СоответствиеКлючей = Новый Структура;
	СоответствиеКлючей.Вставить("feedbackCount", "КоличествоОтзывов");
	СоответствиеКлючей.Вставить("valuation", "РейтингПродавца");
	
	Возврат КлиентAPI.ВыполнитьЗапрос(Токен, Сервер, Перечисления.ВидHTTPЗапроса.GET, Путь, , , СоответствиеКлючей)
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
