#Область ПрограммныйИнтерфейс

Функция ПолучитьИнформациюОПродавце(Токен) Экспорт
	
	// Проверка входных параметров
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	
	АдресСервера = КлиентAPI.СерверОбщий();
	Путь = "/api/v1/seller-info";
	
	ПараметрыМаппинга = Новый Структура;
	ПараметрыМаппинга.Вставить("name", Новый Структура("ИмяКлюча, ТипЗначения", "Наименование", Тип("Строка")));
	ПараметрыМаппинга.Вставить("sid", Новый Структура("ИмяКлюча, ТипЗначения", "Ууид", Тип("Строка")));
	ПараметрыМаппинга.Вставить("tin", Новый Структура("ИмяКлюча, ТипЗначения", "ИНН", Тип("Число")));
	ПараметрыМаппинга.Вставить("tradeMark", Новый Структура("ИмяКлюча, ТипЗначения", "НазваниеМагазина", Тип("Строка")));
	
	Возврат КлиентAPI.ВыполнитьЗапрос(Токен, АдресСервера, Перечисления.ВидHTTPЗапроса.GET, Путь, , , ПараметрыМаппинга)
	
КонецФункции

Функция ПолучитьРейтингПродавца(Токен) Экспорт
	
	// Проверка входных параметров
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	
	Сервер = КлиентAPI.СерверВопросовИОтзывов();
	Путь = "/api/common/v1/rating";
	
	СоответствиеКлючей = Новый Структура;
	СоответствиеКлючей.Вставить("feedbackCount", "КоличествоОтзывов");
	СоответствиеКлючей.Вставить("valuation", "РейтингПродавца");
	
	Возврат КлиентAPI.ВыполнитьЗапрос(Токен, Сервер, Перечисления.ВидHTTPЗапроса.GET, Путь, , , СоответствиеКлючей)
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
