#Область ПрограммныйИнтерфейс

Функция ПолучитьИнформациюОПродавце(Токен) Экспорт
	
	Сервер = "common-api.wildberries.ru";
	Путь = "/api/v1/seller-info";
	
	Возврат КлиентWB.ВыполнитьЗапрос(Токен, Сервер, Перечисления.ВидHTTPЗапроса.GET, Путь, , , ПолчитьСоответствиеКлючей())
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолчитьСоответствиеКлючей()
	
	СоответствиеКлючей = Новый Структура;
	СоответствиеКлючей.Вставить("name", "Наименование");
	СоответствиеКлючей.Вставить("sid", "ИдентификаторПродавца");
	СоответствиеКлючей.Вставить("tin", "ИНН");
	СоответствиеКлючей.Вставить("tradeMark", "ТорговоеНаименование");
	
	Возврат СоответствиеКлючей
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
