
#Область ПрограммныйИнтерфейс

Функция ПривестиСтрокуКТипу(Строка, Тип) Экспорт
	
	Если Строка = Неопределено Тогда
		Возврат Неопределено;
	ИначеЕсли ТипЗнч(Строка) <> Тип("Строка") Тогда 
		Возврат Строка;
	КонецЕсли;
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Тип, Тип("Тип"));
	
	Если Тип = Тип("Дата") Тогда
		Возврат ПрочитатьДатуJSON(Строка, ФорматДатыJSON.ISO);
	Иначе
		Возврат ПрочитатьЗначениеJSON(Строка);
	КонецЕсли;	
	
КонецФункции

Функция ПрименитьМаппинг(Данные, ПараметрыМаппинга, ПараметрыМаппингаКлюча = Неопределено) Экспорт
	
	Если Данные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТипДанных = ТипЗнч(Данные);

	Если ТипДанных = Тип("Структура") Или ТипДанных = Тип("ФиксированнаяСтруктура") Тогда
		
		Результат = Новый Структура;

		Для Каждого КлючИЗначение Из Данные Цикл
			
			Если ПараметрыМаппинга <> Неопределено И ПараметрыМаппинга.Свойство(КлючИЗначение.Ключ, ПараметрыМаппингаКлюча) Тогда
				НовоеЗначение = ПрименитьМаппинг(КлючИЗначение.Значение, ПараметрыМаппинга, ПараметрыМаппингаКлюча);
				Результат.Вставить(ПараметрыМаппингаКлюча.ИмяКлюча, НовоеЗначение);
			Иначе
				Результат.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			КонецЕсли;
			
		КонецЦикла;

		Возврат Результат;

	ИначеЕсли ТипДанных = Тип("Массив") Или ТипДанных = Тип("ФиксированныйМассив") Тогда
		
		Результат = Новый Массив;

		Для Каждого Элемент Из Данные Цикл
			Результат.Добавить(ПрименитьМаппинг(Элемент, ПараметрыМаппинга));
		КонецЦикла;

		Возврат Результат;

	Иначе
		
		Если ПараметрыМаппингаКлюча <> Неопределено Тогда
			Возврат ПривестиСтрокуКТипу(Данные, ПараметрыМаппингаКлюча.ТипЗначения);
		КонецЕсли;
		
		Возврат Данные;
		
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
