
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьГруппуПоНаименование(Наименование) Экспорт
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Возврат БезГруппы;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтатьиДоходовИРасходов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтатьиWB КАК СтатьиДоходовИРасходов
		|ГДЕ
		|	СтатьиДоходовИРасходов.ЭтоГруппа = ИСТИНА
		|	И СтатьиДоходовИРасходов.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	НоваяГруппа = СоздатьГруппу();
	НоваяГруппа.Наименование = Наименование;
	НоваяГруппа.Записать();
	
	Возврат НоваяГруппа.Ссылка;
	
КонецФункции

Функция ПолучитьЭлементПоНаименование(Наименование, Группа = Неопределено) Экспорт
	
	Если Группа = Неопределено ИЛИ Не ЗначениеЗаполнено(Группа) Тогда
		Группа = БезГруппы;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Возврат ПолучитьЭлементПоНаименование(Группа.Наименование, Группа);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтатьиДоходовИРасходов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтатьиWB КАК СтатьиДоходовИРасходов
		|ГДЕ
		|	СтатьиДоходовИРасходов.ЭтоГруппа = ЛОЖЬ
		|	И СтатьиДоходовИРасходов.Наименование = &Наименование
		|	И СтатьиДоходовИРасходов.Родитель = &Группа";
	
	Запрос.УстановитьПараметр("Группа", Группа);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Родитель = Группа;
	НовыйЭлемент.Наименование = Наименование;
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
