
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьПоНаименованию(Наименование) Экспорт
	
	Найденный = НайтиПоНаименованию(Наименование, Истина);
	
	Если Найденный = Неопределено Тогда
		Возврат Неопределено;
	ИначеЕсли Не Найденный.Пустая() Тогда
		Возврат Найденный.Ссылка;
	КонецЕсли;
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = Наименование;
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
