
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура Перезаполнить(Команда)
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	ПерезаполнитьНаСервере(ВыделенныеСтроки);
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Процедура ЗагрузитьНаСервере()
	Документы.ОтчетРеализации.ЗагрузитьВсе();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПерезаполнитьНаСервере(Список)
	Документы.ОтчетРеализации.ПерезаполнитьДетализациюВДокументах(Список);
КонецПроцедуры
#КонецОбласти

