
#Область ПрограммныйИнтерфейс

Функция ПолучитьВсеДетализациюОтчетаРеализации(Токен, ИдОтчета) Экспорт
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(ИдОтчета, Тип("Число"));
	
	Результат = Новый Массив;
	
	Лимит = 100000;
	ИдПоследнийСтроки = 0;
	
	Пока Истина Цикл
		
		ДанныеAPI = ПолучитьДетализациюОтчетаРеализации(Токен, ИдОтчета, Лимит, ИдПоследнийСтроки);
		
		Если ДанныеAPI = Неопределено ИЛИ ДанныеAPI.Количество() = 0 Тогда
			Возврат Результат;
		КонецЕсли;
		
		Для Каждого ЭлементAPI Из ДанныеAPI Цикл
			Результат.Добавить(ЭлементAPI);
		КонецЦикла;
		
		ПоследнийЭлементAPI = Результат.Получить(Результат.Количество() - 1);
		ИдПоследнийСтроки = ПоследнийЭлементAPI.ИдСтроки;
		
	КонецЦикла;
	
КонецФункции

Функция ПолучитьДетализациюОтчетаРеализации(Токен, ИдОтчета, Лимит = 100000, ИдПоследнийСтроки = 0, Поля = Неопределено) Экспорт
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(ИдОтчета, Тип("Число"));
	
	АдресСервера = КлиентAPI.СерверФинансов();
	Путь = "/api/finance/v1/sales-reports/detailed/" + Формат(ИдОтчета, "ЧГ=0;");
	
	ПараметрыJSON = Новый Структура;
	ПараметрыJSON.Вставить("limit", Лимит);
	ПараметрыJSON.Вставить("rrdId", ИдПоследнийСтроки);
	
	Если Поля <> Неопределено Тогда
		ПараметрыJSON.Вставить("fields", Поля);
	КонецЕсли;

	ДанныеAPI = КлиентAPI.ВыполнитьЗапрос(Токен, АдресСервера, Перечисления.ТипыHTTPЗапроса.POST, Путь, , ПараметрыJSON);
	Возврат МаппингЗначений.ПрименитьМаппинг(ДанныеAPI, ПолучитьПараметрыМаппингаДетализацииОтчетаРеализации());
	
КонецФункции

Функция ПолучитьВсеЕжедневныеОтчетыРеализации(Токен, НачалоПериода, КонецПериода = Неопределено) Экспорт

	Если КонецПериода = Неопределено Тогда
		КонецПериода = ТекущаяДатаСеанса();
	КонецЕсли;

	Результат = Новый Массив;

	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(НачалоПериода, Тип("Дата"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(КонецПериода, Тип("Дата"));

	Лимит = 1000;
	Смещение = 0;

	Пока Истина Цикл

		ДанныеAPI = ПолучитьЕжедневныеОтчетыРеализации(Токен, НачалоПериода, КонецПериода, Лимит, Смещение);
		
		Если ДанныеAPI = Неопределено Тогда
			Возврат Результат;
		КонецЕсли;

		Для Каждого ЭлементAPI Из ДанныеAPI Цикл
			Результат.Добавить(ЭлементAPI);
		КонецЦикла;

		Если ДанныеAPI.Количество() < Лимит Тогда
			Прервать;
		КонецЕсли;

		Смещение = Смещение + Лимит;

	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ПолучитьЕжедневныеОтчетыРеализации(Токен, НачалоПериода, КонецПериода, Лимит = 1000, Смещение = 0) Экспорт
	
	// Проверка входных параметров
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьПериод(НачалоПериода, КонецПериода);
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(Лимит, 1, 1000);
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(Смещение, 0);
	
	АдресСервера = КлиентAPI.СерверФинансов();
	Путь = "/api/finance/v1/sales-reports/list";
	ПериодичностьОтчета = "daily";
	
	ПараметрыJSON = Новый Структура;
	ПараметрыJSON.Вставить("dateFrom", НачалоПериода);
	ПараметрыJSON.Вставить("dateTo", КонецПериода);
	ПараметрыJSON.Вставить("limit", Лимит);
	ПараметрыJSON.Вставить("offset", Смещение);
	ПараметрыJSON.Вставить("period", ПериодичностьОтчета);

	ДанныеAPI = КлиентAPI.ВыполнитьЗапрос(Токен, АдресСервера, Перечисления.ТипыHTTPЗапроса.POST, Путь, , ПараметрыJSON);
	Возврат МаппингЗначений.ПрименитьМаппинг(ДанныеAPI, ПолучитьПараметрыМаппингаОтчетаРеализации());
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПараметрыМаппингаОтчетаРеализации()
	
	ПараметрыМаппинга = Новый Структура;
	// ID отчёта
	ПараметрыМаппинга.Вставить("reportId", Новый Структура("ИмяКлюча, ТипЗначения", "ИдОтчета", Тип("Число")));
	// Дата начала отчётного периода
	ПараметрыМаппинга.Вставить("dateFrom", Новый Структура("ИмяКлюча, ТипЗначения", "НачалоПериода", Тип("Дата")));
	// Дата конца отчётного периода
	ПараметрыМаппинга.Вставить("dateTo", Новый Структура("ИмяКлюча, ТипЗначения", "КонецПериода", Тип("Дата")));
	// Дата формирования отчёта
	ПараметрыМаппинга.Вставить("createDate", Новый Структура("ИмяКлюча, ТипЗначения", "Дата", Тип("Дата")));
	// Валюта отчёта
	ПараметрыМаппинга.Вставить("currency", Новый Структура("ИмяКлюча, ТипЗначения", "Валюта", Тип("Строка")));
	// Тип отчёта: 1 - основной, 2 - по выкупам, 3 - по выкупам для Грузии
	ПараметрыМаппинга.Вставить("reportType", Новый Структура("ИмяКлюча, ТипЗначения", "ВидОтчета", Тип("Число")));
	// Продажа
	ПараметрыМаппинга.Вставить("retailAmountSum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаПродаж", Тип("Число")));
	// К перечислению за товар
	ПараметрыМаппинга.Вставить("forPaySum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаКПеречислению", Тип("Число")));
	// Согласованная скидка, %
	ПараметрыМаппинга.Вставить("avgSalePercent", Новый Структура("ИмяКлюча, ТипЗначения", "ПроцентСогласованнойСкидки", Тип("Число")));
	// Стоимость логистики
	ПараметрыМаппинга.Вставить("deliveryServiceSum", Новый Структура("ИмяКлюча, ТипЗначения", "СтоимостьЛогистики", Тип("Число")));
	// Стоимость хранения
	ПараметрыМаппинга.Вставить("paidStorageSum", Новый Структура("ИмяКлюча, ТипЗначения", "СтоимостьХранения", Тип("Число")));
	// Стоимость операций при приёмке
	ПараметрыМаппинга.Вставить("paidAcceptanceSum", Новый Структура("ИмяКлюча, ТипЗначения", "СтоимостьПриемки", Тип("Число")));
	// Прочие удержания и выплаты
	ПараметрыМаппинга.Вставить("deductionSum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаПрочихУдержаний", Тип("Число")));
	// Общая сумма штрафов
	ПараметрыМаппинга.Вставить("penaltySum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаШтрафов", Тип("Число")));
	// Корректировка Вознаграждения Вайлдберриз (ВВ)
	ПараметрыМаппинга.Вставить("additionalPaymentSum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаКорректировкиВознаграждения", Тип("Число")));
	// Сумма, удержанная за начисленные баллы программы лояльности
	ПараметрыМаппинга.Вставить("cashbackAmountSum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаУдержанияЗаБаллы", Тип("Число")));
	// Компенсация скидки по программе лояльности
	ПараметрыМаппинга.Вставить("cashbackDiscountSum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаКомпенсацииСкидкиЛояльности", Тип("Число")));
	// Стоимость участия в программе лояльности
	ПараметрыМаппинга.Вставить("cashbackCommissionChangeSum", Новый Структура("ИмяКлюча, ТипЗначения", "СтоимостьУчастияВЛояльности", Тип("Число")));
	// Разовое изменение срока перечисления денежных средств
	ПараметрыМаппинга.Вставить("paymentSchedule", Новый Структура("ИмяКлюча, ТипЗначения", "СтоимостьИзмененияСрокаПеречисления", Тип("Число")));
	// Итого к оплате
	ПараметрыМаппинга.Вставить("bankPaymentSum", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаКОплате", Тип("Число")));
	
	Возврат ПараметрыМаппинга;
	
КонецФункции

Функция ПолучитьПараметрыМаппингаДетализацииОтчетаРеализации()
	
	ПараметрыМаппинга = Новый Структура;
	// ID отчёта
	ПараметрыМаппинга.Вставить("reportId", Новый Структура("ИмяКлюча, ТипЗначения", "ИдОтчета", Тип("Число")));
	// Дата начала отчётного периода
	ПараметрыМаппинга.Вставить("dateFrom", Новый Структура("ИмяКлюча, ТипЗначения", "НачалоПериода", Тип("Дата")));
	// Дата конца отчётного периода
	ПараметрыМаппинга.Вставить("dateTo", Новый Структура("ИмяКлюча, ТипЗначения", "КонецПериода", Тип("Дата")));
	// Дата формирования отчёта
	ПараметрыМаппинга.Вставить("createDate", Новый Структура("ИмяКлюча, ТипЗначения", "ДатаФормирования", Тип("Дата")));
	// Валюта отчёта
	ПараметрыМаппинга.Вставить("currency", Новый Структура("ИмяКлюча, ТипЗначения", "Валюта", Тип("Строка")));
	// Тип отчёта: 1 - основной, 2 - по выкупам, 3 - по выкупам для Грузии
	ПараметрыМаппинга.Вставить("reportType", Новый Структура("ИмяКлюча, ТипЗначения", "ВидОтчета", Тип("Число")));
	// ID строки
	ПараметрыМаппинга.Вставить("rrdId", Новый Структура("ИмяКлюча, ТипЗначения", "ИдСтроки", Тип("Число")));
	// ID поставки
	ПараметрыМаппинга.Вставить("giId", Новый Структура("ИмяКлюча, ТипЗначения", "ИдПоставки", Тип("Число")));
	// Фиксированный коэффициент склада по поставке
	ПараметрыМаппинга.Вставить("dlvPrc", Новый Структура("ИмяКлюча, ТипЗначения", "ФиксированныйКоэффициентСклада", Тип("Число")));
	// Дата начала действия фиксации
	ПараметрыМаппинга.Вставить("fixTariffDateFrom", Новый Структура("ИмяКлюча, ТипЗначения", "НачалоДействияФиксации", Тип("Дата")));
	// Дата конца действия фиксации
	ПараметрыМаппинга.Вставить("fixTariffDateTo", Новый Структура("ИмяКлюча, ТипЗначения", "КонецДействияФиксации", Тип("Дата")));
	// Предмет
	ПараметрыМаппинга.Вставить("subjectName", Новый Структура("ИмяКлюча, ТипЗначения", "Предмет", Тип("Строка")));
	// Артикул WB
	ПараметрыМаппинга.Вставить("nmId", Новый Структура("ИмяКлюча, ТипЗначения", "АртикулWB", Тип("Число")));
	// Бренд
	ПараметрыМаппинга.Вставить("brandName", Новый Структура("ИмяКлюча, ТипЗначения", "Бренд", Тип("Строка")));
	// Артикул продавца
	ПараметрыМаппинга.Вставить("vendorCode", Новый Структура("ИмяКлюча, ТипЗначения", "АртикулПродавца", Тип("Строка")));
	// Название товара
	ПараметрыМаппинга.Вставить("title", Новый Структура("ИмяКлюча, ТипЗначения", "НазваниеТовара", Тип("Строка")));
	// Размер
	ПараметрыМаппинга.Вставить("techSize", Новый Структура("ИмяКлюча, ТипЗначения", "Размер", Тип("Строка")));
	// Баркод
	ПараметрыМаппинга.Вставить("sku", Новый Структура("ИмяКлюча, ТипЗначения", "Баркод", Тип("Строка")));
	// Тип документа
	ПараметрыМаппинга.Вставить("docTypeName", Новый Структура("ИмяКлюча, ТипЗначения", "ТипДокумента", Тип("Строка")));
	// Количество
	ПараметрыМаппинга.Вставить("quantity", Новый Структура("ИмяКлюча, ТипЗначения", "Количество", Тип("Число")));
	// Цена розничная
	ПараметрыМаппинга.Вставить("retailPrice", Новый Структура("ИмяКлюча, ТипЗначения", "ЦенаРозничная", Тип("Число")));
	// Вайлдберриз реализовал Товар (Пр)
	ПараметрыМаппинга.Вставить("retailAmount", Новый Структура("ИмяКлюча, ТипЗначения", "ЦенаРеализацииWB", Тип("Число")));
	// Согласованный продуктовый дисконт, %
	ПараметрыМаппинга.Вставить("salePercent", Новый Структура("ИмяКлюча, ТипЗначения", "ПроцентПродуктовогоДисконта", Тип("Число")));
	// Размер кВВ, %
	ПараметрыМаппинга.Вставить("commissionPercent", Новый Структура("ИмяКлюча, ТипЗначения", "ПроцентКВВ", Тип("Число")));
	// Склад
	ПараметрыМаппинга.Вставить("officeName", Новый Структура("ИмяКлюча, ТипЗначения", "Склад", Тип("Строка")));
	// Обоснование для оплаты
	ПараметрыМаппинга.Вставить("sellerOperName", Новый Структура("ИмяКлюча, ТипЗначения", "ОбоснованиеДляОплаты", Тип("Строка")));
	// Дата и время заказа
	ПараметрыМаппинга.Вставить("orderDt", Новый Структура("ИмяКлюча, ТипЗначения", "ДатаВремяЗаказа", Тип("Дата")));
	// Дата и время продажи
	ПараметрыМаппинга.Вставить("saleDt", Новый Структура("ИмяКлюча, ТипЗначения", "ДатаВремяПродажи", Тип("Дата")));
	// Дата операции
	ПараметрыМаппинга.Вставить("rrDate", Новый Структура("ИмяКлюча, ТипЗначения", "ДатаОперации", Тип("Дата")));
	// Штрихкод
	ПараметрыМаппинга.Вставить("shkId", Новый Структура("ИмяКлюча, ТипЗначения", "Штрихкод", Тип("Число")));
	// Цена розничная с учётом согласованной скидки
	ПараметрыМаппинга.Вставить("retailPriceWithDisc", Новый Структура("ИмяКлюча, ТипЗначения", "ЦенаРозничнаяСоСкидкой", Тип("Число")));
	// Количество доставок
	ПараметрыМаппинга.Вставить("deliveryAmount", Новый Структура("ИмяКлюча, ТипЗначения", "КоличествоДоставок", Тип("Число")));
	// Количество возврата
	ПараметрыМаппинга.Вставить("returnAmount", Новый Структура("ИмяКлюча, ТипЗначения", "КоличествоВозврата", Тип("Число")));
	// Услуги по доставке товара покупателю
	ПараметрыМаппинга.Вставить("deliveryService", Новый Структура("ИмяКлюча, ТипЗначения", "УслугиДоставки", Тип("Строка")));
	// Тип коробов
	ПараметрыМаппинга.Вставить("giBoxTypeName", Новый Структура("ИмяКлюча, ТипЗначения", "ТипКоробов", Тип("Строка")));
	// Итоговая согласованная скидка, %
	ПараметрыМаппинга.Вставить("productDiscountForReport", Новый Структура("ИмяКлюча, ТипЗначения", "ПроцентИтоговойСогласованнойСкидки", Тип("Число")));
	// Промокод, %
	ПараметрыМаппинга.Вставить("sellerPromo", Новый Структура("ИмяКлюча, ТипЗначения", "ПроцентПромокода", Тип("Строка")));
	// Платформенные скидки, %
	ПараметрыМаппинга.Вставить("spp", Новый Структура("ИмяКлюча, ТипЗначения", "ПроцентПлатформеннойСкидки", Тип("Число")));
	// Размер кВВ без НДС, % базовый
	ПараметрыМаппинга.Вставить("kvwBase", Новый Структура("ИмяКлюча, ТипЗначения", "ПроцентКВВБазовый", Тип("Число")));
	// Итоговый кВВ без НДС, %
	ПараметрыМаппинга.Вставить("kvw", Новый Структура("ИмяКлюча, ТипЗначения", "ПроцентИтоговыйКВВ", Тип("Число")));
	// Размер снижения кВВ из-за рейтинга, %
	ПараметрыМаппинга.Вставить("supRatingUp", Новый Структура("ИмяКлюча, ТипЗначения", "ПроцентСниженияКВВЗаРейтинг", Тип("Число")));
	// Размер снижения кВВ из-за акции, %
	ПараметрыМаппинга.Вставить("isKgvpV2", Новый Структура("ИмяКлюча, ТипЗначения", "ПроцентСниженияКВВЗаАкцию", Тип("Число")));
	// Вознаграждение с продаж до вычета услуг поверенного, без НДС
	ПараметрыМаппинга.Вставить("ppvzSalesCommission", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаВознагражденияСПродаж", Тип("Число")));
	// К перечислению продавцу за реализованный товар
	ПараметрыМаппинга.Вставить("forPay", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаКПеречислениюПродавцу", Тип("Число")));
	// Возмещение за выдачу и возврат товаров на ПВЗ
	ПараметрыМаппинга.Вставить("ppvzReward", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаВозмещенияПВЗ", Тип("Число")));
	// Компенсация платёжных услуг/Комиссия за интеграцию платёжных сервисов
	ПараметрыМаппинга.Вставить("acquiringFee", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаКомпенсацииПлатежныхУслуг", Тип("Число")));
	// Размер компенсации платёжных услуг/Комиссии за интеграцию платёжных сервисов, %
	ПараметрыМаппинга.Вставить("acquiringPercent", Новый Структура("ИмяКлюча, ТипЗначения", "ПроцентКомпенсацииПлатежныхУслуг", Тип("Число")));
	// Тип платежа: компенсация платёжных услуг/Комиссия за интеграцию платёжных сервисов
	ПараметрыМаппинга.Вставить("paymentProcessing", Новый Структура("ИмяКлюча, ТипЗначения", "ТипПлатежныхУслуг", Тип("Строка")));
	// Наименование банка-эквайера
	ПараметрыМаппинга.Вставить("acquiringBank", Новый Структура("ИмяКлюча, ТипЗначения", "БанкЭквайер", Тип("Строка")));
	// Вознаграждение Вайлдберриз (ВВ), без НДС
	ПараметрыМаппинга.Вставить("vw", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаВознагражденияWB", Тип("Число")));
	// НДС с вознаграждения Вайлдберриз
	ПараметрыМаппинга.Вставить("vwNds", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаНДСВознагражденияWB", Тип("Число")));
	// Наименование офиса доставки
	ПараметрыМаппинга.Вставить("ppvzOfficeName", Новый Структура("ИмяКлюча, ТипЗначения", "ОфисДоставки", Тип("Строка")));
	// ID офиса доставки
	ПараметрыМаппинга.Вставить("ppvzOfficeId", Новый Структура("ИмяКлюча, ТипЗначения", "ИдОфисаДоставки", Тип("Число")));
	// Партнёр
	ПараметрыМаппинга.Вставить("ppvzSupplierName", Новый Структура("ИмяКлюча, ТипЗначения", "Партнер", Тип("Строка")));
	// ИНН партнёра
	ПараметрыМаппинга.Вставить("ppvzSupplierInn", Новый Структура("ИмяКлюча, ТипЗначения", "ИННПартнера", Тип("Строка")));
	// Номер таможенной декларации
	ПараметрыМаппинга.Вставить("declarationNumber", Новый Структура("ИмяКлюча, ТипЗначения", "НомерТаможеннойДекларации", Тип("Строка")));
	// Виды логистики, штрафов и корректировок ВВ
	ПараметрыМаппинга.Вставить("bonusTypeName", Новый Структура("ИмяКлюча, ТипЗначения", "ВидыЛогистикиШтрафов", Тип("Строка")));
	// Стикер МП
	ПараметрыМаппинга.Вставить("stickerId", Новый Структура("ИмяКлюча, ТипЗначения", "СтикерМП", Тип("Строка")));
	// Страна продажи
	ПараметрыМаппинга.Вставить("country", Новый Структура("ИмяКлюча, ТипЗначения", "СтранаПродажи", Тип("Строка")));
	// Признак услуги платной доставки
	ПараметрыМаппинга.Вставить("srvDbs", Новый Структура("ИмяКлюча, ТипЗначения", "ПризнакПлатнойДоставки", Тип("Булево")));
	// Общая сумма штрафов
	ПараметрыМаппинга.Вставить("penalty", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаШтрафов", Тип("Число")));
	// Корректировка Вознаграждения Вайлдберриз (ВВ)
	ПараметрыМаппинга.Вставить("additionalPayment", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаКорректировкиВознагражденияWB", Тип("Число")));
	// Возмещение издержек по перевозке/по складским операциям с товаром
	ПараметрыМаппинга.Вставить("rebillLogisticCost", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаВозмещенияИздержек", Тип("Число")));
	// Организатор перевозки
	ПараметрыМаппинга.Вставить("rebillLogisticOrg", Новый Структура("ИмяКлюча, ТипЗначения", "ОрганизаторПеревозки", Тип("Строка")));
	// Хранение
	ПараметрыМаппинга.Вставить("paidStorage", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаХранения", Тип("Число")));
	// Удержания
	ПараметрыМаппинга.Вставить("deduction", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаУдержаний", Тип("Число")));
	// Операции на приёмке
	ПараметрыМаппинга.Вставить("paidAcceptance", Новый Структура("ИмяКлюча, ТипЗначения", "ОперацииНаПриемке", Тип("Число")));
	// ID сборочного задания
	ПараметрыМаппинга.Вставить("orderId", Новый Структура("ИмяКлюча, ТипЗначения", "ИдСборочногоЗадания", Тип("Число")));
	// Код маркировки
	ПараметрыМаппинга.Вставить("kiz", Новый Структура("ИмяКлюча, ТипЗначения", "КодМаркировки", Тип("Строка")));
	// Признак B2B-продажи
	ПараметрыМаппинга.Вставить("isB2b", Новый Структура("ИмяКлюча, ТипЗначения", "ПризнакB2BПродажи", Тип("Булево")));
	// ID короба для обработки товара
	ПараметрыМаппинга.Вставить("trbxId", Новый Структура("ИмяКлюча, ТипЗначения", "ИдКороба", Тип("Строка")));
	// Скидка по программе софинансирования
	ПараметрыМаппинга.Вставить("installmentCofinancingAmount", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаСкидкиСофинансирования", Тип("Число")));
	// Скидка Wibes, %
	ПараметрыМаппинга.Вставить("wibesDiscountPercent", Новый Структура("ИмяКлюча, ТипЗначения", "ПроцентСкидкиWibes", Тип("Число")));
	// Сумма, удержанная за начисленные баллы программы лояльности
	ПараметрыМаппинга.Вставить("cashbackAmount", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаУдержанияЗаБаллы", Тип("Число")));
	// Компенсация скидки по программе лояльности
	ПараметрыМаппинга.Вставить("cashbackDiscount", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаКомпенсацииСкидкиЛояльности", Тип("Число")));
	// Стоимость участия в программе лояльности
	ПараметрыМаппинга.Вставить("cashbackCommissionChange", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаУчастияВЛояльности", Тип("Число")));
	// Разовое изменение срока перечисления денежных средств
	ПараметрыМаппинга.Вставить("paymentSchedule", Новый Структура("ИмяКлюча, ТипЗначения", "СуммаИзмененияСрокаПеречисления", Тип("Число")));
	// Способ продажи и тип товара
	ПараметрыМаппинга.Вставить("deliveryMethod", Новый Структура("ИмяКлюча, ТипЗначения", "СпособПродажи", Тип("Строка")));
	// ID собственной акции продавца с дополнительной скидкой
	ПараметрыМаппинга.Вставить("sellerPromoId", Новый Структура("ИмяКлюча, ТипЗначения", "ИдАкцииПродавца", Тип("Число")));
	// Размер дополнительной скидки по собственной акции продавца, %
	ПараметрыМаппинга.Вставить("sellerPromoDiscount", Новый Структура("ИмяКлюча, ТипЗначения", "ПроцентДополнительнойСкидкиАкции", Тип("Число")));
	// ID скидки лояльности от продавца
	ПараметрыМаппинга.Вставить("loyaltyId", Новый Структура("ИмяКлюча, ТипЗначения", "ИдСкидкиЛояльности", Тип("Число")));
	// Размер скидки лояльности от продавца, %
	ПараметрыМаппинга.Вставить("loyaltyDiscount", Новый Структура("ИмяКлюча, ТипЗначения", "ПроцентСкидкиЛояльности", Тип("Число")));
	// ID промокода
	ПараметрыМаппинга.Вставить("uuidPromocode", Новый Структура("ИмяКлюча, ТипЗначения", "ИдПромокода", Тип("Строка")));
	// Скидка за промокод, %
	ПараметрыМаппинга.Вставить("salePricePromocodeDiscountPrc", Новый Структура("ИмяКлюча, ТипЗначения", "ПроцентСкидкиЗаПромокод", Тип("Число")));
	// ID подменного артикула
	ПараметрыМаппинга.Вставить("articleSubstitution", Новый Структура("ИмяКлюча, ТипЗначения", "ИдПодменногоАртикула", Тип("Строка")));
	// Скидка по подменному артикулу, %
	ПараметрыМаппинга.Вставить("salePriceAffiliatedDiscountPrc", Новый Структура("ИмяКлюча, ТипЗначения", "ПроцентСкидкиПодменногоАртикула", Тип("Число")));
	// Удержание Агентского НДС, %
	ПараметрыМаппинга.Вставить("agencyVat", Новый Структура("ИмяКлюча, ТипЗначения", "ПроцентАгентскогоНДС", Тип("Число")));
	// Оптовая скидка для бизнеса, %
	ПараметрыМаппинга.Вставить("salePriceWholesaleDiscountPrc", Новый Структура("ИмяКлюча, ТипЗначения", "ПроцентОптовойСкидкиДляБизнеса", Тип("Число")));
	// ID корзины заказа - транзакции
	ПараметрыМаппинга.Вставить("orderUid", Новый Структура("ИмяКлюча, ТипЗначения", "ИдКорзиныЗаказа", Тип("Строка")));
	// ID заказа
	ПараметрыМаппинга.Вставить("srid", Новый Структура("ИмяКлюча, ТипЗначения", "ИдЗаказа", Тип("Строка")));
	
	Возврат ПараметрыМаппинга;
	
КонецФункции


#КонецОбласти
