
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьВсе() Экспорт
	
	Токен = КлиентAPI.ПолучитьТокенAPI();
	
	ДанныеAPI = ПоставкиAPI.ПолучитьСписокСкладов(Токен);
	ДанныеAPI = МаппингЗначений.ПрименитьМаппинг(ДанныеAPI, ПолучитьПараметрыМаппинга());
	
	Если ДанныеAPI = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементAPI Из ДанныеAPI Цикл
		ОбновитьИлиСоздать(ЭлементAPI);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбновитьИлиСоздать(ДанныеAPI)
	
	Объект = Неопределено;
	Ссылка = НайтиПоКоду(ДанныеAPI.Код, Истина);
	
	Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
		Объект = СоздатьЭлемент();
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI);
	
	Объект.Записать();
	Возврат Объект.Ссылка;
	
КонецФункции

Процедура ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI)
	
	МаппингЗначений.ЗаполнитьОбъектИзДанных(Объект, ДанныеAPI);
	
КонецПроцедуры

Функция ПолучитьПараметрыМаппинга()
	
	ПараметрыМаппинга = Новый Структура;
	// ID склада
	ПараметрыМаппинга.Вставить("ID", Новый Структура("ИмяКлюча, ТипЗначения", "Код", Тип("Число")));
	// Название склада
	ПараметрыМаппинга.Вставить("name", Новый Структура("ИмяКлюча, ТипЗначения", "Наименование", Тип("Строка")));
	// Адрес склада
	ПараметрыМаппинга.Вставить("address", Новый Структура("ИмяКлюча, ТипЗначения", "Адрес", Тип("Строка")));
	// Режим работы склада
	ПараметрыМаппинга.Вставить("workTime", Новый Структура("ИмяКлюча, ТипЗначения", "РежимРаботы", Тип("Строка")));
	// Доступен ли в качестве склада назначения
	ПараметрыМаппинга.Вставить("isActive", Новый Структура("ИмяКлюча, ТипЗначения", "ДоступноНазначение", Тип("Булево")));
	// Доступен ли в качестве транзитного склада
	ПараметрыМаппинга.Вставить("isTransitActive", Новый Структура("ИмяКлюча, ТипЗначения", "ДоступенТранзит", Тип("Булево")));
	
	Возврат ПараметрыМаппинга;
	
КонецФункции


#КонецОбласти

#КонецЕсли
