#Область ПрограммныйИнтерфейс

Функция ПолучитьВсеПоставки(Токен, НачалоПериода, КонецПериода = Неопределено) Экспорт

	Если КонецПериода = Неопределено Тогда
		КонецПериода = ТекущаяДатаСеанса();
	КонецЕсли;

	Результат = Новый Массив;

	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(НачалоПериода, Тип("Дата"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(КонецПериода, Тип("Дата"));

	Лимит = 1000;
	Смещение = 0;

	Пока Истина Цикл

		ДанныеAPI = ПолучитьПоставки(Токен, НачалоПериода, КонецПериода, Лимит, Смещение);

		Для Каждого ЭлементAPI Из ДанныеAPI Цикл
			Результат.Добавить(ЭлементAPI);
		КонецЦикла;

		Если ДанныеAPI.Количество() < Лимит Тогда
			Прервать;
		КонецЕсли;

		Смещение = Смещение + Лимит;

	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ПолучитьВсеТоварыПоставки(Токен, Ид, ЭтоИдЗаказа = Ложь) Экспорт

	Результат = Новый Массив;

	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Ид, Тип("Число"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(ЭтоИдЗаказа, Тип("Булево"));

	Лимит = 1000;
	Смещение = 0;

	Пока Истина Цикл

		ДанныеAPI = ПолучитьТоварыПоставки(Токен, Ид, ЭтоИдЗаказа, Лимит, Смещение);

		Для Каждого ЭлементAPI Из ДанныеAPI Цикл
			Результат.Добавить(ЭлементAPI);
		КонецЦикла;

		Если ДанныеAPI.Количество() < Лимит Тогда
			Прервать;
		КонецЕсли;

		Смещение = Смещение + Лимит;

	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьПоставки(Токен, НачалоПериода, КонецПериода, Лимит = 1000, Смещение = 0) Экспорт

	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(НачалоПериода, Тип("Дата"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(КонецПериода, Тип("Дата"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(Лимит, 1, 1000);
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(Смещение, 0);

	АдресСервера = КлиентAPI.СерверПоставок();
	Путь = "/api/v1/supplies";

	ПараметрыЗапросаURL = Новый Структура;
	ПараметрыЗапросаURL.Вставить("limit", Лимит);
	ПараметрыЗапросаURL.Вставить("offset", Формат(Смещение, "ЧН=0; ЧГ=0;"));

	ПараметрыЗапросаJSON = Новый Структура;
	
	ПараметрыЗапросаJSONПериод = Новый Структура;
	ПараметрыЗапросаJSONПериод.Вставить("from", Формат(НачалоПериода, "ДФ=yyyy-MM-dd;"));
//	ПараметрыЗапросаJSONПериод.Вставить("till", Формат(КонецПериода, "ДФ=yyyy-MM-dd;"));
	ПараметрыЗапросаJSONПериод.Вставить("type", "createDate");
	
	ПараметрыЗапросаJSONПериоды = Новый Массив;
	ПараметрыЗапросаJSONПериоды.Добавить(ПараметрыЗапросаJSONПериод);
	
	ПараметрыЗапросаJSON.Вставить("dates", ПараметрыЗапросаJSONПериоды);

	ДанныеAPI = КлиентAPI.ВыполнитьЗапрос(Токен, АдресСервера, Перечисления.ТипыHTTPЗапроса.POST, Путь, ПараметрыЗапросаURL, ПараметрыЗапросаJSON);
	Возврат МаппингЗначений.ПрименитьМаппинг(ДанныеAPI, ПолучитьПараметрыМаппингаПоставки());

КонецФункции

Функция ПолучитьТоварыПоставки(Токен, Ид, ЭтоИдЗаказа = Ложь, Лимит = 1000, Смещение = 0) Экспорт
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Ид, Тип("Число"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(ЭтоИдЗаказа, Тип("Булево"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(Лимит, 1, 1000);
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(Смещение, 0);
	
	АдресСервера = КлиентAPI.СерверПоставок();
	Путь = "/api/v1/supplies/" + Формат(Ид, "ЧГ=0;") + "/goods";
	
	ПараметрыЗапросаURL = Новый Структура;
	ПараметрыЗапросаURL.Вставить("limit", Лимит);
	ПараметрыЗапросаURL.Вставить("offset", Смещение);
	ПараметрыЗапросаURL.Вставить("isPreorderID", ЭтоИдЗаказа);
	
	ДанныеAPI = КлиентAPI.ВыполнитьЗапрос(Токен, АдресСервера, Перечисления.ТипыHTTPЗапроса.GET, Путь, ПараметрыЗапросаURL);
	Возврат МаппингЗначений.ПрименитьМаппинг(ДанныеAPI, ПолучитьПараметрыМаппингаТовара());
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПараметрыМаппингаПоставки()

	ПараметрыМаппинга = Новый Структура;
	
	// Телефон пользователя, создавшего поставку
	ПараметрыМаппинга.Вставить("phone", Новый Структура("ИмяКлюча, ТипЗначения", "Телефон", Тип("Строка")));
	// ID поставки. Если null, это заказ, тогда используйте значение поля preorderID
	ПараметрыМаппинга.Вставить("supplyID", Новый Структура("ИмяКлюча, ТипЗначения", "ИдПоставки", Тип("Число")));
	// ID заказа (незапланированная поставка). Для всех виртуальных поставок будет 0
	ПараметрыМаппинга.Вставить("preorderID", Новый Структура("ИмяКлюча, ТипЗначения", "ИдЗаказа", Тип("Число")));
	// Дата и время создания поставки
	ПараметрыМаппинга.Вставить("createDate", Новый Структура("ИмяКлюча, ТипЗначения", "ДатаСоздания", Тип("Дата")));
	// Плановая дата отгрузки поставки
	ПараметрыМаппинга.Вставить("supplyDate", Новый Структура("ИмяКлюча, ТипЗначения", "ДатаОтгрузкиПлановая", Тип("Дата")));
	// Дата фактической отгрузки поставки
	ПараметрыМаппинга.Вставить("factDate", Новый Структура("ИмяКлюча, ТипЗначения", "ДатаОтгрузкиФактическая", Тип("Дата")));
	// Дата изменения поставки
	ПараметрыМаппинга.Вставить("updatedDate", Новый Структура("ИмяКлюча, ТипЗначения", "ДатаИзменения", Тип("Дата")));
	// ID статуса поставки:
	// 1 — Не запланировано
	// 2 — Запланировано
	// 3 — Отгрузка разрешена
	// 4 — Идёт приёмка
	// 5 — Принято
	// 6 — Отгружено на воротах
	ПараметрыМаппинга.Вставить("statusID", Новый Структура("ИмяКлюча, ТипЗначения", "ИдСтатуса", Тип("Число")));
	// ID типа поставки:
	// 0 — Без коробов (виртуальная поставка)
	// 1 и 2 — Короба
	// 5 — Монопаллеты
	// 6 — Суперсейф
	ПараметрыМаппинга.Вставить("boxTypeID", Новый Структура("ИмяКлюча, ТипЗначения", "ИдТипаПоставки", Тип("Число")));
	// Тип поставки — Поштучная палета:
	// true — да
	// false — нет
	ПараметрыМаппинга.Вставить("isBoxOnPallet", Новый Структура("ИмяКлюча, ТипЗначения", "ПоштучнаяПалета", Тип("Булево")));

	Возврат ПараметрыМаппинга;

КонецФункции

Функция ПолучитьПараметрыМаппингаТовара()

	ПараметрыМаппинга = Новый Структура;
	
	// Баркод товара
	ПараметрыМаппинга.Вставить("barcode", Новый Структура("ИмяКлюча, ТипЗначения", "Баркод", Тип("Строка")));
	// Артикул продавца
	ПараметрыМаппинга.Вставить("vendorCode", Новый Структура("ИмяКлюча, ТипЗначения", "АртикулПродавца", Тип("Строка")));
	// Артикул WB
	ПараметрыМаппинга.Вставить("nmID", Новый Структура("ИмяКлюча, ТипЗначения", "АртикулWB", Тип("Число")));
	// Нужен ли код маркировки для этого товара
	// false - не нужен
	// true - нужен
	ПараметрыМаппинга.Вставить("needKiz", Новый Структура("ИмяКлюча, ТипЗначения", "НуженКодМаркировки", Тип("Булево")));
	// Код ТНВЭД. Если needKiz:true, а tnved:null, нужно заполнить характеристику товара ТН ВЭД в личном кабинете или по API
	ПараметрыМаппинга.Вставить("tnved", Новый Структура("ИмяКлюча, ТипЗначения", "КодТНВЭД", Тип("Строка")));
	// Размер товара, указанный продавцом
	ПараметрыМаппинга.Вставить("techSize", Новый Структура("ИмяКлюча, ТипЗначения", "Размер", Тип("Строка")));
	// Цвет товара
	ПараметрыМаппинга.Вставить("color", Новый Структура("ИмяКлюча, ТипЗначения", "Цвет", Тип("Строка")));
	// Указано в упаковке, шт
	ПараметрыМаппинга.Вставить("supplierBoxAmount", Новый Структура("ИмяКлюча, ТипЗначения", "КоличествоВУпаковке", Тип("Число")));
	// Указано в поставке/заказе, шт
	ПараметрыМаппинга.Вставить("quantity", Новый Структура("ИмяКлюча, ТипЗначения", "КоличествоВПоставке", Тип("Число")));
	// Поступило в продажу, шт
	ПараметрыМаппинга.Вставить("readyForSaleQuantity", Новый Структура("ИмяКлюча, ТипЗначения", "КоличествоПоступилоВПродажу", Тип("Число")));
	// Принято, шт
	ПараметрыМаппинга.Вставить("acceptedQuantity", Новый Структура("ИмяКлюча, ТипЗначения", "КоличествоПринято", Тип("Число")));
	// Количество товара на раскладке, шт
	ПараметрыМаппинга.Вставить("unloadingQuantity", Новый Структура("ИмяКлюча, ТипЗначения", "КоличествоНаРаскладке", Тип("Число")));

	Возврат ПараметрыМаппинга;

КонецФункции


#КонецОбласти