#Область ПрограммныйИнтерфейс

Функция ПолучитьВсеПоставки(Токен, НачалоПериода, КонецПериода = Неопределено) Экспорт

	Если КонецПериода = Неопределено Тогда
		КонецПериода = ТекущаяДатаСеанса();
	КонецЕсли;

	ВсеПоставки = Новый Массив;

	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(НачалоПериода, Тип("Дата"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(КонецПериода, Тип("Дата"));

	Лимит = 1000;
	Смещение = 0;

	Пока Истина Цикл

		ДанныеAPI = ПолучитьПоставки(Токен, НачалоПериода, КонецПериода, Лимит, Смещение);

		Для Каждого ЭлементAPI Из ДанныеAPI Цикл
			ВсеПоставки.Добавить(ЭлементAPI);
		КонецЦикла;

		Если ДанныеAPI.Количество() < Лимит Тогда
			Прервать;
		КонецЕсли;

		Смещение = Смещение + Лимит;

	КонецЦикла;

	Возврат ВсеПоставки;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьПоставки(Токен, НачалоПериода, КонецПериода, Лимит = 1000, Смещение = 0) Экспорт

	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(Токен, Тип("Строка"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(НачалоПериода, Тип("Дата"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(КонецПериода, Тип("Дата"));
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(Лимит, 1, 1000);
	ПроверкаЗначенийКлиентСервер.ПроверитьЧисло(Смещение, 0);

	АдресСервера = КлиентAPI.СерверПоставок();
	Путь = "/api/v1/supplies";

	ПараметрыЗапросаURL = Новый Структура;
	ПараметрыЗапросаURL.Вставить("limit", Лимит);
	ПараметрыЗапросаURL.Вставить("offset", Формат(Смещение, "ЧН=0; ЧГ=0;"));

	ПараметрыЗапросаJSON = Новый Структура;
	
	ПараметрыЗапросаJSONПериод = Новый Структура;
	ПараметрыЗапросаJSONПериод.Вставить("from", Формат(НачалоПериода, "ДФ=yyyy-MM-dd;"));
//	ПараметрыЗапросаJSONПериод.Вставить("till", Формат(КонецПериода, "ДФ=yyyy-MM-dd;"));
	ПараметрыЗапросаJSONПериод.Вставить("type", "createDate");
	
	ПараметрыЗапросаJSONПериоды = Новый Массив;
	ПараметрыЗапросаJSONПериоды.Добавить(ПараметрыЗапросаJSONПериод);
	
	ПараметрыЗапросаJSON.Вставить("dates", ПараметрыЗапросаJSONПериоды);

	ДанныеAPI = КлиентAPI.ВыполнитьЗапрос(Токен, АдресСервера, Перечисления.ТипыHTTPЗапроса.POST, Путь, ПараметрыЗапросаURL, ПараметрыЗапросаJSON);
	Возврат МаппингЗначений.ПрименитьМаппинг(ДанныеAPI, ПолучитьПараметрыМаппинга());

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПараметрыМаппинга()

	ПараметрыМаппинга = Новый Структура;
	
	// Телефон пользователя, создавшего поставку
	ПараметрыМаппинга.Вставить("phone", Новый Структура("ИмяКлюча, ТипЗначения", "Телефон", Тип("Строка")));
	// ID поставки. Если null, это заказ, тогда используйте значение поля preorderID
	ПараметрыМаппинга.Вставить("supplyID", Новый Структура("ИмяКлюча, ТипЗначения", "ИдПоставки", Тип("Число")));
	// ID заказа (незапланированная поставка). Для всех виртуальных поставок будет 0
	ПараметрыМаппинга.Вставить("preorderID", Новый Структура("ИмяКлюча, ТипЗначения", "ИдЗаказа", Тип("Число")));
	// Дата и время создания поставки
	ПараметрыМаппинга.Вставить("createDate", Новый Структура("ИмяКлюча, ТипЗначения", "ДатаСоздания", Тип("Дата")));
	// Плановая дата отгрузки поставки
	ПараметрыМаппинга.Вставить("supplyDate", Новый Структура("ИмяКлюча, ТипЗначения", "ДатаОтгрузкиПлановая", Тип("Дата")));
	// Дата фактической отгрузки поставки
	ПараметрыМаппинга.Вставить("factDate", Новый Структура("ИмяКлюча, ТипЗначения", "ДатаОтгрузкиФактическая", Тип("Дата")));
	// Дата изменения поставки
	ПараметрыМаппинга.Вставить("updatedDate", Новый Структура("ИмяКлюча, ТипЗначения", "ДатаИзменения", Тип("Дата")));
	// ID статуса поставки:
	// 1 — Не запланировано
	// 2 — Запланировано
	// 3 — Отгрузка разрешена
	// 4 — Идёт приёмка
	// 5 — Принято
	// 6 — Отгружено на воротах
	ПараметрыМаппинга.Вставить("statusID", Новый Структура("ИмяКлюча, ТипЗначения", "ИдСтатуса", Тип("Число")));
	// ID типа поставки:
	// 0 — Без коробов (виртуальная поставка)
	// 1 и 2 — Короба
	// 5 — Монопаллеты
	// 6 — Суперсейф
	ПараметрыМаппинга.Вставить("boxTypeID", Новый Структура("ИмяКлюча, ТипЗначения", "ИдТипаПоставки", Тип("Число")));
	// Тип поставки — Поштучная палета:
	// true — да
	// false — нет
	ПараметрыМаппинга.Вставить("isBoxOnPallet", Новый Структура("ИмяКлюча, ТипЗначения", "ПоштучнаяПалета", Тип("Булево")));

	Возврат ПараметрыМаппинга;

КонецФункции

#КонецОбласти