
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВыбратьДатуПоследнегоДокумента(Продавец) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказыПокупателей.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказыПокупателей КАК ЗаказыПокупателей
	|ГДЕ
	|	ЗаказыПокупателей.Продавец = &Продавец
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Продавец", Продавец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Дата;
	
КонецФункции

Процедура ЗагрузитьВсе() Экспорт
	
	Продавцы = Справочники.Продавцы.ВыбратьВсехПродавцов();
	
	Для Каждого Продавец Из Продавцы Цикл
		ЗагрузитьПоПродавцу(Продавец);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьПоПродавцу(Продавец) Экспорт
	
	НачалоПериода = ПолучитьНачалоПериодаЗагрузки(Продавец);
	Загрузить(Продавец, НачалоПериода);
	
КонецПроцедуры

Процедура Загрузить(Продавец, НачалоПериода) Экспорт
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(НачалоПериода, Тип("Дата"));
	
	Токен = Справочники.Продавцы.ПолучитьТокен(Продавец);
	ДанныеAPI = ЗаказыПокупателейAPI.ПолучитьВсеЗаказы(Токен, НачалоПериода);
	
	Если ДанныеAPI = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ДанныеAPIЗаказ Из ДанныеAPI Цикл
		ОбновитьИлиСоздать(Продавец, ДанныеAPIЗаказ);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПоДетализацииОтчетаРеализации(СтрДетализации, ОтчетРеализации, Продавец) Экспорт

	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(СтрДетализации, Тип("ДокументТабличнаяЧастьСтрока.ОтчетРеализации.Детализация"));

	Если Не ЗначениеЗаполнено(СтрДетализации.ИдЗаказа) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Результат = НайтиПоРеквизиту("ИДЗаказа", СтрДетализации.ИдЗаказа);

	Если Не ЗначениеЗаполнено(Результат) Тогда

		Выборка = РегистрыСведений.СтатьиДРВЗаказах.ВыбратьПоСтатье(СтрДетализации.Статья);
		
		Если ЗначениеЗаполнено(Выборка) Тогда
			Результат = СоздатьНаОснованииДетализацииОтчетаРеализации(СтрДетализации, ОтчетРеализации, Продавец, Выборка.ЗаказОтменен);			
		КонецЕсли;
		
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция СоздатьНаОснованииДетализацииОтчетаРеализации(СтрДетализации, ОтчетРеализации, Продавец, ЗаказОтменен) Экспорт
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(СтрДетализации, Тип("ДокументТабличнаяЧастьСтрока.ОтчетРеализации.Детализация"));
	
	Объект = СоздатьДокумент();
	Объект.СозданНаОсновании = ОтчетРеализации;
	Объект.Продавец = Продавец;
	Объект.Отменен = ЗаказОтменен;
	Объект.Дата = СтрДетализации.ДатаВремяЗаказа;
	Объект.ДатаОбновления = СтрДетализации.ДатаВремяЗаказа;
	Объект.ИДЗаказа = СтрДетализации.ИДЗаказа;
	Объект.ИДКорзиныПокупателя = СтрДетализации.ИдКорзиныЗаказа;
	Объект.КарточкаТовара = СтрДетализации.КарточкаТовара;
	Объект.Поставка = СтрДетализации.Поставка;
	Объект.Размер = СтрДетализации.Размер;
	Объект.СкладОтгрузки = СтрДетализации.Склад;
	Объект.Страна = СтрДетализации.СтранаПродажи;
	Объект.ЦенаБезСкидок = СтрДетализации.ЦенаРозничная;
	Объект.ЦенаСоСкидкойПродавца = СтрДетализации.ЦенаРозничнаяСоСкидкой;
	
	Объект.Записать();
	
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = "Создан " + Объект;
	СообщениеПользователю.КлючДанных = Объект.Ссылка;
	СообщениеПользователю.Сообщить();
	
	Возврат Объект.Ссылка;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбновитьИлиСоздать(Продавец, ДанныеAPIЗаказ)
	
	Объект = Неопределено;
	Ссылка = НайтиПоРеквизиту("ИдЗаказа", ДанныеAPIЗаказ.ИдЗаказа);
	
	Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
		Объект = СоздатьДокумент();
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	Объект.Продавец = Продавец;
	ЗаполнитьИзДанныхAPI(Объект, ДанныеAPIЗаказ);
	
	Объект.Записать();
	Возврат Объект;
	
КонецФункции

Процедура ЗаполнитьИзДанныхAPI(Объект, ДанныеAPIЗаказ)
	
	Объект.Дата = ДанныеAPIЗаказ.Дата;
	Объект.Отменен = ДанныеAPIЗаказ.Отменен;
	Объект.ДатаОтмены = ДанныеAPIЗаказ.ДатаОтмены;
	Объект.ДатаОбновления = ДанныеAPIЗаказ.ДатаОбновления;
	Объект.КарточкаТовара = Справочники.КарточкиТоваров.НайтиПоРеквизиту("АртикулWB", ДанныеAPIЗаказ.АртикулWB, , Объект.Продавец);
	Объект.Размер = Справочники.РазмерыКарточекТоваров.НайтиПоРеквизиту("Размер", ДанныеAPIЗаказ.Размер, , Объект.КарточкаТовара);
	Объект.Поставка = Документы.Поставки.НайтиПоИдПоставки(ДанныеAPIЗаказ.ИдПоставки);
	Объект.СкладОтгрузки = Справочники.СкладыWB.НайтиПоНаименованию(ДанныеAPIЗаказ.СкладОтгрузки, Истина);
	Объект.ТипСклада = Перечисления.ТипыСкладов.ПолучитьПоНаименованию(ДанныеAPIЗаказ.ТипСклада);
	Объект.Страна = Справочники.Страны.ПолучитьПоНаименованию(ДанныеAPIЗаказ.Страна);
	Объект.Округ = Справочники.Округа.ПолучитьПоНаименованию(ДанныеAPIЗаказ.Округ);
	Объект.Регион = Справочники.Регионы.ПолучитьПоНаименованию(ДанныеAPIЗаказ.Регион);
	Объект.ЭтоДоговорПоставки = ДанныеAPIЗаказ.ЭтоДоговорПоставки;
	Объект.ЭтоДоговорРеализации = ДанныеAPIЗаказ.ЭтоДоговорРеализации;
	Объект.ЦенаБезСкидок = ДанныеAPIЗаказ.ЦенаБезСкидок;
	Объект.СкидкаПродавцаПроцент = ДанныеAPIЗаказ.СкидкаПродавцаПроцент;
	Объект.СкидкаWBПроцент = ДанныеAPIЗаказ.СкидкаWBПроцент;
	Объект.ЦенаСоСкидками = ДанныеAPIЗаказ.ЦенаСоСкидками;
	Объект.ЦенаСоСкидкойПродавца = ДанныеAPIЗаказ.ЦенаСоСкидкойПродавца;
	Объект.ИДСтикера = ДанныеAPIЗаказ.ИДСтикера;
	Объект.ИДКорзиныПокупателя = ДанныеAPIЗаказ.ИДКорзиныПокупателя;
	Объект.ИДЗаказа = ДанныеAPIЗаказ.ИДЗаказа;
	
КонецПроцедуры

Функция ПолучитьНачалоПериодаЗагрузки(Продавец)
	
	ДатаПоследнегоДокумента = ВыбратьДатуПоследнегоДокумента(Продавец);
	
	Если ДатаПоследнегоДокумента <> Неопределено Тогда
		Возврат ДатаПоследнегоДокумента;
	КонецЕсли;
	
	Возврат Справочники.Продавцы.ПолучитьДатуРегистрации(Продавец);

КонецФункции

#КонецОбласти

#КонецЕсли
