
#Область ПрограммныйИнтерфейс

Процедура ЗагрузкаЗаказов() Экспорт
	Документы.ЗаказыПокупателей.ЗагрузитьВсе();	
КонецПроцедуры

Процедура ЗагрузкаПоставок() Экспорт
	Документы.Поставки.ЗагрузитьВсе();	
КонецПроцедуры

Процедура ЗагрузкаФинансовыхОтчетов() Экспорт
	Документы.ОтчетРеализации.ЗагрузитьВсе();	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
